import { Department } from '@/types/department'

export const detailDepartment: Department[] = [
  {
    key:'appliedChemist1',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต (แบบ 1.1) สาขาวิชาเคมีประยุกต์ (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบุคลากรที่มีความรู้ความชํานาญด้านเคมีประยุกต์ขั้นสูง มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ เพื่อส่งเสริมและเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ซึ่งนําไปสู่กระบวนการผลิต และแปรรูปผลิตภัณฑ์ในอุตสาหกรรมที่มีประสิทธิภาพ และมีศักยภาพในการพึ่งพาตนเองมากขึ้นในอนาคต โดยมุ่งเน้นการวิจัยและพัฒนาองค์ความรู้ใหม่ เชื่อมโยงและบูรณาการศาสตร์ที่ตนเชี่ยวชาญกับศาสตร์อื่นได้',
    importance: '',
    CourseNameThai: 'ปรัชญาดุษฎีบัณฑิต สาขาวิชาเคมีประยุกต์',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Chemistry',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'},
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158201',
            name: 'ระเบียบวิธีวิจัย/RESEARCH METHODOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158202',
            name: 'นวัตกรรมเคมีประยุกต์/INNOVATIONS IN APPLIED CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158193',
            name: 'วิชาสัมมนาเคมีประยุกต์ 3/SEMINAR IN APPLIED CHEMISTRY 3',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158194',
            name: 'วิชาสัมมนาเคมีประยุกต์ 4/SEMINAR IN APPLIED CHEMISTRY 4',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158121',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/chemi_dc2560.pdf',
    Infographic: ''
  },
  {
    key:'appliedChemist2',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต (แบบ 1.2) สาขาวิชาเคมีประยุกต์ (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบุคลากรที่มีความรู้ความชํานาญด้านเคมีประยุกต์ขั้นสูง มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ เพื่อส่งเสริมและเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ซึ่งนําไปสู่กระบวนการผลิต และแปรรูปผลิตภัณฑ์ในอุตสาหกรรมที่มีประสิทธิภาพ และมีศักยภาพในการพึ่งพาตนเองมากขึ้นในอนาคต โดยมุ่งเน้นการวิจัยและพัฒนาองค์ความรู้ใหม่ เชื่อมโยงและบูรณาการศาสตร์ที่ตนเชี่ยวชาญกับศาสตร์อื่นได้',
    importance: '',
    CourseNameThai: 'ปรัชญาดุษฎีบัณฑิต สาขาวิชาเคมีประยุกต์',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Chemistry',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'},
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158201',
            name: 'ระเบียบวิธีวิจัย/RESEARCH METHODOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158202',
            name: 'นวัตกรรมเคมีประยุกต์/INNOVATIONS IN APPLIED CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158…',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05158191',
            name: 'วิชาสัมมนาเคมีประยุกต์ 1/SEMINAR IN APPLIED CHEMISTRY 1',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158192',
            name: 'วิชาสัมมนาเคมีประยุกต์ 2/SEMINAR IN APPLIED CHEMISTRY 2',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158193',
            name: 'วิชาสัมมนาเคมีประยุกต์ 3/SEMINAR IN APPLIED CHEMISTRY 3',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158194',
            name: 'วิชาสัมมนาเคมีประยุกต์ 4/SEMINAR IN APPLIED CHEMISTRY 4',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05158122',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 7,
            hours: '0-315-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/chemi_dc2560.pdf',
    Infographic: ''
  },
  {
    key:'appliedMath1',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต แบบ 1.1 สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตร พ.ศ. 2560',
    philosophy: 'หลักสูตรเน้นให้บัณฑิตมีความรู้วิชาการคณิตศาสตร์อย่างถ่องแท้ มุ่งแสวงหาความรู้ใหม่และบูรณา การกับศาสตร์ที่เกี่ยวข้อง มีทักษะการใช้ความรู้คณิตศาสตร์กับศาสตร์ในสาขาอื่น เพื่อการแก้ปัญหา ทั้ง ภาครัฐและเอกชน',
    importance: 'คณิตศาสตร์เป็นพื้นฐานสำคัญของงานวิจัย ทั้งในเชิงทฤษฎีและเชิงประยุกต์ที่นำไปใช้งานได้จริง งานทางด้านวิศวกรรมศาสตร์ วิทยาศาสตร์หลายแขนง รวมถึงงานทางด้านเศรษฐศาสตร์และบริหารธุรกิจ จำเป็นต้องใช้คณิตศาสตร์ในการพิสูจน์และคำนวณทฤษฎีใหม่ ๆ ที่ค้นพบ ด้วยเหตุนี้สาขาวิชาคณิตศาสตร์ จึงได้มุ่งผลิตปรัชญาดุษฎีบัณฑิต ที่มีความเชี่ยวชาญทางด้านคณิตศาสตร์พื้นฐานและคณิตศาสตร์ประยุกต์ เพื่อรองรับความต้องการบุคลากรทางด้านนี้ ที่มีมากขึ้นอย่างต่อเนื่องทั้งในภาครัฐและภาคเอกชน และเพื่อ ตอบสนองความต้องการของประเทศและให้สอดคล้องกับแผนกลยุทธ์ด้านวิทยาศาสตร์และเทคโนโลยี (พ.ศ. 2557-2566) และแผนพัฒนาการศึกษาระดับอุดมศึกษาฉบับที่ 12 (พ.ศ.2560-2564)',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Mathematics',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'},
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          },
          {
            ID: '05018007',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 1 /Ph.D. SEMINAR IN APPLIED MATHEMATICS 1',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          },
          {
            ID: '05018033',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 2 /Ph.D. SEMINAR IN APPLIED MATHEMATICS 2',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          },
          {
            ID: '05018034',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 3 /Ph.D. SEMINAR IN APPLIED MATHEMATICS 3',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018000',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-180'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedMath2',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต แบบ 2.1 สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตร พ.ศ. 2560',
    philosophy: 'หลักสูตรเน้นให้บัณฑิตมีความรู้วิชาการคณิตศาสตร์อย่างถ่องแท้ มุ่งแสวงหาความรู้ใหม่และบูรณา การกับศาสตร์ที่เกี่ยวข้อง มีทักษะการใช้ความรู้คณิตศาสตร์กับศาสตร์ในสาขาอื่น เพื่อการแก้ปัญหา ทั้ง ภาครัฐและเอกชน',
    importance: 'คณิตศาสตร์เป็นพื้นฐานสำคัญของงานวิจัย ทั้งในเชิงทฤษฎีและเชิงประยุกต์ที่นำไปใช้งานได้จริง งานทางด้านวิศวกรรมศาสตร์ วิทยาศาสตร์หลายแขนง รวมถึงงานทางด้านเศรษฐศาสตร์และบริหารธุรกิจ จำเป็นต้องใช้คณิตศาสตร์ในการพิสูจน์และคำนวณทฤษฎีใหม่ ๆ ที่ค้นพบ ด้วยเหตุนี้สาขาวิชาคณิตศาสตร์ จึงได้มุ่งผลิตปรัชญาดุษฎีบัณฑิต ที่มีความเชี่ยวชาญทางด้านคณิตศาสตร์พื้นฐานและคณิตศาสตร์ประยุกต์ เพื่อรองรับความต้องการบุคลากรทางด้านนี้ ที่มีมากขึ้นอย่างต่อเนื่องทั้งในภาครัฐและภาคเอกชน และเพื่อ ตอบสนองความต้องการของประเทศและให้สอดคล้องกับแผนกลยุทธ์ด้านวิทยาศาสตร์และเทคโนโลยี (พ.ศ. 2557-2566) และแผนพัฒนาการศึกษาระดับอุดมศึกษาฉบับที่ 12 (พ.ศ.2560-2564)',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Mathematics',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'},
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018007',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 1/Ph.D. SEMINAR IN APPLIED MATHEMATICS 1',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-134'
          },
          {
            ID: '05018008',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 2/Ph.D. SEMINAR IN APPLIED MATHEMATICS 2',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-134'
          },
          {
            ID: '05018009',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 3/Ph.D. SEMINAR IN APPLIED MATHEMATICS 3',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-540-134'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-540-134'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedPhysics',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ หลักสูตรปรับปรุง พ.ศ. 2560',
    philosophy: 'การผลิตบัณฑิตระดับปริญญาเอกสาขาวิชาเทคโนโลยีชีวภาพที่มีคุณภาพ เพื่อสนองความต้องการสําหรับ การพัฒนาอุตสาหกรรมและเกษตรกรรมของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและเกษตรกรรมของประเทศ',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาฟิสิกส์ประยุกต',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Physics',
    Job: [
      {name: 'นักวิจัย / นักวิทยาศาสตร์ / นักวิชาการ'},
      {name: 'นักวิเคราะห์ข้อมูล'},
      {name: 'อาจารย์ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'},
      {name: 'นักออกแบบผลิตภัณฑ์ / อุปกรณ์ทางด้านวิทยาศาสตร์'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05307198',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-210'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05307198',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-210'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05307181',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-210'
          },
          {
            ID: '05307181',
            name: 'สัมมนา/SEMINAR',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05307181',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-210'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1.png'
  },
  {
    key:'appliedMath2',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต แบบ 2.1 สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตร พ.ศ. 2560',
    philosophy: 'หลักสูตรเน้นให้บัณฑิตมีความรู้วิชาการคณิตศาสตร์อย่างถ่องแท้ มุ่งแสวงหาความรู้ใหม่และบูรณา การกับศาสตร์ที่เกี่ยวข้อง มีทักษะการใช้ความรู้คณิตศาสตร์กับศาสตร์ในสาขาอื่น เพื่อการแก้ปัญหา ทั้ง ภาครัฐและเอกชน',
    importance: 'คณิตศาสตร์เป็นพื้นฐานสำคัญของงานวิจัย ทั้งในเชิงทฤษฎีและเชิงประยุกต์ที่นำไปใช้งานได้จริง งานทางด้านวิศวกรรมศาสตร์ วิทยาศาสตร์หลายแขนง รวมถึงงานทางด้านเศรษฐศาสตร์และบริหารธุรกิจ จำเป็นต้องใช้คณิตศาสตร์ในการพิสูจน์และคำนวณทฤษฎีใหม่ ๆ ที่ค้นพบ ด้วยเหตุนี้สาขาวิชาคณิตศาสตร์ จึงได้มุ่งผลิตปรัชญาดุษฎีบัณฑิต ที่มีความเชี่ยวชาญทางด้านคณิตศาสตร์พื้นฐานและคณิตศาสตร์ประยุกต์ เพื่อรองรับความต้องการบุคลากรทางด้านนี้ ที่มีมากขึ้นอย่างต่อเนื่องทั้งในภาครัฐและภาคเอกชน และเพื่อ ตอบสนองความต้องการของประเทศและให้สอดคล้องกับแผนกลยุทธ์ด้านวิทยาศาสตร์และเทคโนโลยี (พ.ศ. 2557-2566) และแผนพัฒนาการศึกษาระดับอุดมศึกษาฉบับที่ 12 (พ.ศ.2560-2564)',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Doctor of Philosophy Program in Applied Mathematics',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'},
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018xxx',
            name: 'วิชาเลือก/Option',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05018007',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 1/Ph.D. SEMINAR IN APPLIED MATHEMATICS 1',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-134'
          },
          {
            ID: '05018008',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 2/Ph.D. SEMINAR IN APPLIED MATHEMATICS 2',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-134'
          },
          {
            ID: '05018009',
            name: 'สัมมนาปริญญาเอกทางคณิตศาสตร์ประยุกต์ 3/Ph.D. SEMINAR IN APPLIED MATHEMATICS 3',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-540-134'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05018010',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-540-134'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedBiology1',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต (แบบ 1.1 ผู้เข้าศึกษาที่สำเร็จปริญญาโท) สาขาวิชาเทคโนโลยีชีวภาพ หลักสูตรปรับปรุง พ.ศ. 2559',
    philosophy: 'การผลิตบัณฑิตระดับปริญญาเอกสาขาวิชาเทคโนโลยีชีวภาพที่มีคุณภาพ เพื่อสนองความต้องการสําหรับ การพัฒนาอุตสาหกรรมและเกษตรกรรมของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและเกษตรกรรมของประเทศ',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีชีวภาพ',
    CourseNameEng: 'Doctor of Philosophy Program in Biotechnology',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208101',
            name: 'สัมมนาปริญญาเอก 1/DOCTORAL SEMINAR 1',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208102',
            name: 'สัมมนาปริญญาเอก 2/DOCTORAL SEMINAR 2',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208011',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208011',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208011',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208011',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/Bio_Change2559_edit.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A0%E0%B8%B2%E0%B8%9E.png'
  },
  {
    key:'appliedBiology2',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต (แบบ 1.2 ผู้เข้าศึกษาที่สำเร็จปริญญาตรี) สาขาวิชาเทคโนโลยีชีวภาพ หลักสูตรปรับปรุง พ.ศ. 2559',
    philosophy: 'การผลิตบัณฑิตระดับปริญญาเอกสาขาวิชาเทคโนโลยีชีวภาพที่มีคุณภาพ เพื่อสนองความต้องการสําหรับ การพัฒนาอุตสาหกรรมและเกษตรกรรมของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและเกษตรกรรมของประเทศ',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีชีวภาพ',
    CourseNameEng: 'Doctor of Philosophy Program in Biotechnology',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208101',
            name: 'สัมมนาปริญญาเอก 1/DOCTORAL SEMINAR 1',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208102',
            name: 'สัมมนาปริญญาเอก 2/DOCTORAL SEMINAR 2',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          },
          {
            ID: '05208103',
            name: 'สัมมนาปริญญาเอก 3/DOCTORAL SEMINAR 3',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          },
          {
            ID: '05208104',
            name: 'สัมมนาปริญญาเอก 4/DOCTORAL SEMINAR 4',
            credit: 1,
            hours: '0-3-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05208012',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 12,
            hours: '0-540-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/Bio_Change2559_edit.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A0%E0%B8%B2%E0%B8%9E.png'
  },
  {
    key:'com1',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ ( แบบ 1.1 สำหรับผู้เข้าศึกษาที่สำเร็จปริญญาโท )',
    philosophy: 'เพื่อผลิตบัณฑิตทางวิทยาการคอมพิวเตอร์ที่มีความรู้และความชำนาญในการวิจัยในระดับสูง สามารถ บุกเบิกแสวงหาความรู้ใหม่ได้อย่างมีอิสระ สามารถจัดระเบียบและเชื่อมโยงความรู้ทางทฤษฎี และปฏิบัติ รวมถึงความชำนาญด้านการวิจัย ให้เกิดเป็นองค์ความรู้ใหม่ด้วยความคิดเชิงระบบอย่างมีประสิทธิภาพ ตลอดจนเป็นบุคคลที่มีภาวะผู้นำภายใต้สำนึกในคุณธรรม จริยธรรมในการนำความรู้ไปใช้ให้เกิดประโยชน์ ต่อตนเอง สังคม และประเทศชาติ',
    importance: 'เนื่องด้วย วิทยาศาสตร์และเทคโนโลยีเป็นกลไกสำคัญในการพัฒนาประเทศให้ก้าวหน้า พร้อมแข่งขัน และรองรับการเปลี่ยนแปลงเศรษฐกิจโลก วิทยาการคอมพิวเตอร์เป็นสาขาวิชาหนึ่งที่มีความสำคัญและ จำเป็นต่อการพัฒนาทางด้านวิทยาศาสตร์และเทคโนโลยี จึงจำเป็นต้องมีบุคลากรทางด้านวิทยาการ คอมพิวเตอร์ รวมถึงบุคลากรที่มีความรู้ความชำนาญด้านการวิจัยทางวิทยาการคอมพิวเตอร์อย่าง เพียงพอ เพื่อเป็นองค์ประกอบที่เข้มแข็งในการพัฒนาประเทศต่อไป',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์',
    CourseNameEng: 'Doctor of Philosophy Program in Computer Science',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'อาจารย์'},
      {name: 'ที่ปรึกษาหน่วยงาน/โครงการ ระดับนานาชาติ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          },
          {
            ID: '05508031',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 1/SEMINAR IN COMPUTER SCIENCE 1',
            credit: 1,
            hours: '0-3-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          },
          {
            ID: '05508032',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 2/SEMINAR IN COMPUTER SCIENCE 2',
            credit: 1,
            hours: '0-3-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          },
          {
            ID: '05508033',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 3/SEMINAR IN COMPUTER SCIENCE 3',
            credit: 1,
            hours: '0-3-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508021',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/com_dc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'com2',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ ( แบบ 1.1 สำหรับผู้เข้าศึกษาที่สำเร็จปริญญาโท )',
    philosophy: 'เพื่อผลิตบัณฑิตทางวิทยาการคอมพิวเตอร์ที่มีความรู้และความชำนาญในการวิจัยในระดับสูง สามารถ บุกเบิกแสวงหาความรู้ใหม่ได้อย่างมีอิสระ สามารถจัดระเบียบและเชื่อมโยงความรู้ทางทฤษฎี และปฏิบัติ รวมถึงความชำนาญด้านการวิจัย ให้เกิดเป็นองค์ความรู้ใหม่ด้วยความคิดเชิงระบบอย่างมีประสิทธิภาพ ตลอดจนเป็นบุคคลที่มีภาวะผู้นำภายใต้สำนึกในคุณธรรม จริยธรรมในการนำความรู้ไปใช้ให้เกิดประโยชน์ ต่อตนเอง สังคม และประเทศชาติ',
    importance: 'เนื่องด้วย วิทยาศาสตร์และเทคโนโลยีเป็นกลไกสำคัญในการพัฒนาประเทศให้ก้าวหน้า พร้อมแข่งขัน และรองรับการเปลี่ยนแปลงเศรษฐกิจโลก วิทยาการคอมพิวเตอร์เป็นสาขาวิชาหนึ่งที่มีความสำคัญและ จำเป็นต่อการพัฒนาทางด้านวิทยาศาสตร์และเทคโนโลยี จึงจำเป็นต้องมีบุคลากรทางด้านวิทยาการ คอมพิวเตอร์ รวมถึงบุคลากรที่มีความรู้ความชำนาญด้านการวิจัยทางวิทยาการคอมพิวเตอร์อย่าง เพียงพอ เพื่อเป็นองค์ประกอบที่เข้มแข็งในการพัฒนาประเทศต่อไป',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์',
    CourseNameEng: 'Doctor of Philosophy Program in Computer Science',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'อาจารย์'},
      {name: 'ที่ปรึกษาหน่วยงาน/โครงการ ระดับนานาชาติ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508001',
            name: 'การวิเคราะห์และออกแบบขั้นตอนวิธี/ANANLYSIS AND DESIGN OF ALGORITHM',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508002',
            name: 'ปัญญาประดิษฐ์/ARTIFICIAL INTELLIGENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508004',
            name: 'ระเบียบวิธีวิจัยสําหรับวิทยาการคอมพิวเตอร์/RESEARCH METHODOLOGY IN COMPUTER SCIENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508003',
            name: 'หลักการวิทยาศาสตร์ข้อมูล/PRINCIPLES OF DATA SCIENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508041',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 1/SEMINAR IN COMPUTER SCIENCE 1',
            credit: 1,
            hours: '0-3-6'
          },
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508042',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 2/SEMINAR IN COMPUTER SCIENCE 2',
            credit: 1,
            hours: '0-3-6'
          },
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508022',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/com_dc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'com3',
    name: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ ( แบบ 2.2 สำหรับผู้เข้าศึกษาที่สำเร็จปริญญาตรี )',
    philosophy: 'เพื่อผลิตบัณฑิตทางวิทยาการคอมพิวเตอร์ที่มีความรู้และความชำนาญในการวิจัยในระดับสูง สามารถ บุกเบิกแสวงหาความรู้ใหม่ได้อย่างมีอิสระ สามารถจัดระเบียบและเชื่อมโยงความรู้ทางทฤษฎี และปฏิบัติ รวมถึงความชำนาญด้านการวิจัย ให้เกิดเป็นองค์ความรู้ใหม่ด้วยความคิดเชิงระบบอย่างมีประสิทธิภาพ ตลอดจนเป็นบุคคลที่มีภาวะผู้นำภายใต้สำนึกในคุณธรรม จริยธรรมในการนำความรู้ไปใช้ให้เกิดประโยชน์ ต่อตนเอง สังคม และประเทศชาติ',
    importance: 'เนื่องด้วย วิทยาศาสตร์และเทคโนโลยีเป็นกลไกสำคัญในการพัฒนาประเทศให้ก้าวหน้า พร้อมแข่งขัน และรองรับการเปลี่ยนแปลงเศรษฐกิจโลก วิทยาการคอมพิวเตอร์เป็นสาขาวิชาหนึ่งที่มีความสำคัญและ จำเป็นต่อการพัฒนาทางด้านวิทยาศาสตร์และเทคโนโลยี จึงจำเป็นต้องมีบุคลากรทางด้านวิทยาการ คอมพิวเตอร์ รวมถึงบุคลากรที่มีความรู้ความชำนาญด้านการวิจัยทางวิทยาการคอมพิวเตอร์อย่าง เพียงพอ เพื่อเป็นองค์ประกอบที่เข้มแข็งในการพัฒนาประเทศต่อไป',
    CourseNameThai: 'หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์',
    CourseNameEng: 'Doctor of Philosophy Program in Computer Science',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'อาจารย์'},
      {name: 'ที่ปรึกษาหน่วยงาน/โครงการ ระดับนานาชาติ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508001',
            name: 'การวิเคราะห์และออกแบบขั้นตอนวิธี/ANANLYSIS AND DESIGN OF ALGORITHM',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508002',
            name: 'ปัญญาประดิษฐ์/ARTIFICIAL INTELLIGENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508004',
            name: 'ระเบียบวิธีวิจัยสําหรับวิทยาการคอมพิวเตอร์/RESEARCH METHODOLOGY IN COMPUTER SCIENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508003',
            name: 'หลักการวิทยาศาสตร์ข้อมูล/PRINCIPLES OF DATA SCIENCE',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508041',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 1/SEMINAR IN COMPUTER SCIENCE 1',
            credit: 1,
            hours: '0-3-6'
          },
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508042',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 2/SEMINAR IN COMPUTER SCIENCE 2',
            credit: 1,
            hours: '0-3-6'
          },
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508xxx',
            name: 'วิชาเลือก/ELECTIVES',
            credit: 3,
            hours: '0-3-6'
          },
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05508023',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0-360-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/com_dc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C.png'
  }
]