import { Department } from '@/types/department'

export const detailDepartment: Department[] = [
  {
    key:'chemist',
    name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสิ่งแวดล้อมและการจัดการอย่างยั่งยืน หลักสูตรปรับปรุง พ.ศ.2565',
    philosophy: 'หลักสูตรนี้มุ่งที่จะผลิตบัณฑิตนักปฏิบัติที่มีความรู้ความชำนาญด้านเทคโนโลยีสิ่งแวดล้อม และการจัดการสิ่งแวดล้อมอย่างยั่งยืน มีคุณธรรม จรรยาบรรณทางวิชาการ และวิชาชีพที่ดี โดยบัณฑิตที่จบจากหลักสูตรนี้สามารถคิดวิเคราะห์ บูรณาการความรู้ด้านการจัดการสิ่งแวดล้อม และเทคโนโลยี มาใช้ในการป้องกัน และแก้ไขผลกระทบที่เกิดขึ้นจากปัญหาสิ่งแวดล้อมได้อย่างมีประสิทธิภาพ ร่วมรับผิดชอบต่อสังคม โดยใช้หลักการที่เป็นมิตรต่อสิ่งแวดล้อม เพื่อตอบสนองต่อการพัฒนาเศรษฐกิจ สังคม และสิ่งแวดล้อมในระดับชาติและระดับภูมิภาคอาเซียน',
    importance: 'ประเทศไทยมีการขยายตัวทางเศรษฐกิจอย่างรวดเร็วจนกลายเป็นหนึ่งในผู้นำทางเศรษฐกิจในภูมิภาคอาเซียน ทั้งนี้เนื่องมาจากมีการวางแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติอย่างต่อเนื่องกันมาจนถึงปัจจุบัน ประกอบกับการกำหนดทิศทางการเจริญเติบโตทางเศรษฐกิจของประเทศไทยที่มุ่งเน้นให้มีการขยายตัวทางอุตสาหกรรม พาณิชยกรรม และการลงทุนจากต่างประเทศ ส่งผลให้ทรัพยากรธรรมชาติถูกทำลายไป และสภาพแวดล้อมเสื่อมโทรม การพัฒนาคุณภาพชีวิตและสิ่งแวดล้อมเป็นเป้าหมายหนึ่งที่องค์กรในทุกระดับยอมรับว่ามีความสำคัญและเป็นประเด็นเร่งด่วนที่ต้องลงมือกระทำอย่างจริงจังและต่อเนื่อง รวมทั้งการขาดแคลนบุคลากรที่มีความรู้ความชำนาญด้านการป้องกันและแก้ไขปัญหาทางสิ่งแวดล้อม ภาควิชาเคมี คณะวิทยาศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง เห็นประโยชน์ของการมีส่วนร่วมในการรับผิดชอบต่อสังคม และร่วมพัฒนาประเทศ จึงได้จัดการศึกษาหลักสูตรวิทยาศาสตรบัณฑิต สาขาเทคโนโลยีสิ่งแวดล้อมและการจัดการอย่างยั่งยืน เพื่อผลิตบุคลากรที่มีความรู้และความสามารถในการประยุกต์ใช้ความรู้ทางการจัดการสิ่งแวดล้อมและเทคโนโลยีในการป้องกันและแก้ไขปัญหาสิ่งแวดล้อม ทั้งที่เกิดจากภาคอุตสาหกรรม และเกิดจากภาคประชาชน ตลอดจนสามารถฟื้นฟูสภาพแวดล้อมให้ดีขึ้นด้วย รวมทั้งมีจิตสำนึกในการบริหารจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อมอย่างยั่งยืน',
    CourseNameThai: 'วิทยาศาสตรบัณฑิต สาขาเทคโนโลยีสิ่งแวดล้อมและการจัดการอย่างยั่งยืน',
    CourseNameEng: 'Bachelor of Science in Environmental Technology and Sustainable Management',
    Job: [
      {name: 'นักวิชาการสิ่งแวดล้อม'},
      {name: 'เจ้าหน้าที่ประเมินผลกระทบสิ่งแวดล้อม'},
      {name: 'ผู้ปฏิบัติการสอน/ฝึกอบรมในวิชาการด้านสิ่งแวดล้อม'},
      {name: 'นักวิจัย/นักวิทยาศาสตร์ด้านสิ่งแวดล้อม'}
    ],
    Video: 'https://www.youtube.com/embed/WcHxeMRFpv8',
    Plan: [],
    DownloadCourse: 'https://www.science.kmitl.ac.th/assets/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%AA%E0%B8%B4%E0%B9%88%E0%B8%87%E0%B9%81%E0%B8%A7%E0%B8%94%E0%B8%A5%E0%B9%89%E0%B8%AD%E0%B8%A1.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/info/%E0%B9%80%E0%B8%84%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%B4%E0%B9%88%E0%B8%87%E0%B9%81%E0%B8%A7%E0%B8%94%E0%B8%A5%E0%B9%89%E0%B8%AD%E0%B8%A1.png',
  },{
    key:'math',
    name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตรปี พ.ศ. 2565',
    philosophy: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์ เน้นให้บัณฑิตมีความรู้วิชาการคณิตศาสตร์เพื่อการแสวงหาความรู้ใหม่และบูรณาการกับศาสตร์ที่เกี่ยวข้อง และมีทักษะการใช้ความรู้คณิตศาสตร์และสารสนเทศ เพื่อสนับสนุนการแก้ปัญหาธุรกิจและอุตสาหกรรม',
    importance: 'การเจริญก้าวหน้าของประเทศทั้งด้านเศรษฐกิจและสังคม วิทยาศาสตร์และเทคโนโลยี และด้านวิศวกรรม เป็นไปอย่างรวดเร็ว และได้มีการนำเอาวิทยาการทางคณิตศาสตร์ไปประยุกต์ใช้ในด้านต่างๆ เป็นอย่างมาก เช่น การใช้คณิตศาสตร์เพื่อวางแผนการผลิต การจัดการซัพพลายเชนและโลจิสติกส์ การประยุกต์ใช้คณิตศาสตร์เกี่ยวกับเชิงปริมาณให้เกิดประโยชน์ จำเป็นต้องมีความเข้าใจทั้งในทฤษฎีวิทยาการและมีทักษะเฉพาะทาง ทำให้มีความต้องการบุคลากรที่มีความรู้คณิตศาสตร์อย่างดีควบคู่กับศาสตร์ด้านวิทยาศาสตร์เทคโนโลยีและอุตสาหกรรม เป็นจำนวนมากในการประยุกต์แก้ปัญหา และหากต้องศึกษาวิจัยในขั้นสูงขึ้นจำเป็นต้องใช้ความรู้ทางคณิตศาสตร์อย่างมาก และมีการศึกษาวิจัยพบว่าประเทศไทยขาดแคลนนักวิทยาศาสตร์และนักคณิตศาสตร์ ซึ่งหมายถึงขาดแคลนผู้ที่จะมีส่วนในการพัฒนาเทคโนโลยีที่เหมาะสมกับสภาพแวดล้อมของประเทศไทย ในสภาวะที่มีการแข่งขันในด้านเศรษฐกิจกับนานาชาติ ส่วนการผลิตบุคลากรในด้านคณิตศาสตร์ประยุกต์ในระดับที่มีความรู้ความสามารถทั้งภาคทฤษฎีและเชี่ยวชาญการประยุกต์ใช้ตลอดจนการศึกษาวิจัย ยังผลิตได้ในอัตราที่ต่ำมากเมื่อเทียบกับสัดส่วนการผลิตบุคลากรด้านอื่นๆ และสัดส่วนประชากรของประเทศ ภาควิชาคณิตศาสตร์ คณะวิทยาศาสตร์ ซึ่งมีความพร้อมทั้งด้านบุคลากรและอุปกรณ์บริภัณฑ์ทางด้านคอมพิวเตอร์ ได้เล็งเห็นความสำคัญและความจำเป็นของการพัฒนาบุคลากรด้านคณิตศาสตร์ประยุกต์ จึงเห็นว่าควรปรับปรุงหลักสูตรคณิตศาสตร์ประยุกต์ เพื่อให้ประเทศได้มีบุคลากรที่มีความรู้และเชี่ยวชาญในด้านคณิตศาสตร์ประยุกต์ ที่สามารถเป็นผู้นำในการประยุกต์ใช้แก้ปัญหาหรือร่วมแก้ปัญหา ตลอดจนการศึกษาวิจัยเพื่อพัฒนาเทคโนโลยีด้วยตนเอง ภาควิชาคาดหวังว่าบัณฑิตที่สำเร็จการศึกษาจากหลักสูตรจะสามารถนำเอาความรู้ไปประยุกต์ใช้กับสายงานต่างๆ ได้อย่างมีประสิทธิภาพ ประกอบอาชีพอย่างมีจริยธรรมและคุณธรรมและมีความรับผิดชอบต่อสังคม อันเป็นการสนองนโยบายรัฐบาลในการผลิตบุคลากรสาขาขาดแคลนและเป็นการพัฒนาประเทศอีกทางหนึ่ง',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Bachelor of Science (Applied Mathematics)',
    Job: [
      {name: 'นักคณิตศาสตร์'},
      {name: 'นักวิเคราะห์ข้อมูลเพื่อการตัดสินใจ'},
      {name: 'นักพัฒนาโปรแกรมคอมพิวเตอร์'},
      {name: 'ศึกษาต่อเพื่อเป็นนักวิจัย หรือ นักวิชาการ'},
      {name: 'บุคลากรด้านการศึกษา'},
      {name: 'บุคลากรด้านอุตสาหกรรม'},
      {name: 'บุคลากรในธุรกิจการจัดการความเสี่ยง และการเงิน'},
      {name: 'บุคลากรในสายงานสารสนเทศ'},
    ],
    Video: 'https://www.youtube.com/embed/JhBT9VJCVE0',
    Plan: [],
    DownloadCourse: 'https://www.science.kmitl.ac.th/assets/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/info/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png',
  },{
    key:'physics',
    name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรม หลักสูตรปี พ.ศ. 2564',
    philosophy: 'เพื่อผลิตบัณฑิตทางด้านฟิสิกส์อุตสาหกรรมที่มีความรู้ความสามารถทั้งทางทฤษฏีและปฎิบัติ มีคุณธรรม และจริยธรรม ที่สอดคล้องกับปณิธานของสถาบัน ซึ่งสามารถบูรณาการองค์ความรู้และทักษะทางด้านฟิสิกส์อุตสาหกรรม นำไปสู่การพัฒนาประเทศที่ยั่งยืนและสามารถพึ่งพาตนเองได้',
    importance: 'การพัฒนาในประเทศไทยทางด้านวิทยาศาสตร์และเทคโนโลยียังขาดแคลนบุคลากรที่มีความรู้ มีความสามารถและทักษะในทางปฏิบัติเฉพาะทางด้านฟิสิกส์แล้วสามารถนำความรู้มาประยุกต์เพื่อใช้ในการวิเคราะห์และแก้ปัญหาในงานด้านอุตสาหกรรม ด้านสิ่งแวดล้อม ด้านสถาปัตยกรรม ด้านการแพทย์ ด้านเกษตรกรรม เป็นต้น สำหรับในงานแต่ละด้านจะมีการซ่อมบำรุงและพัฒนาหรือประยุกต์อุปกรณ์และเครื่องมือในการตรวจสอบและวิเคราะห์ทั้งในเชิงคุณภาพและเชิงปริมาณโดยจะอาศัยหลักการพื้นฐานความรู้และความเชี่ยวชาญเฉพาะทางฟิสิกส์มาประยุกต์พร้อมกับสามารถบูรณาการความรู้และความเข้าใจนำไปสู่งานวิจัย ผลงานประดิษฐ์นวัตกรรมอย่างสร้างสรรค์ การตรวจสอบและวิเคราะห์เพื่อใช้แก้ปัญหาในงานด้านต่างๆได้อย่างมีประสิทธิภาพด้วยคุณธรรมและจริยธรรม ดังนั้นหลักสูตรฟิสิกส์อุตสาหกรรมจึงมีการวางแผนการศึกษาเพื่อพัฒนาหลักสูตรให้ทันสมัยผลิตบัณฑิตให้ตรงกับความต้องการของตลาดแรงงาน และสอดคล้องตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาของมาตรฐานการเรียนรู้ 5 ด้าน คือ คุณธรรม-จริยธรรม ความรู้ ทักษะทางปัญญา ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ ของหลักสูตรฟิสิกส์อุตสาหกรรม โดยมุ่งเน้นด้านวิทยาศาสตร์และเทคโนโลยีเพื่อให้มีความสอดคล้องกับพันธกิจของสถาบัน และกรอบทิศทางการศึกษาตามแผนพัฒนาประเทศทั้งในด้าน เศรษฐกิจ สังคม และวัฒนธรรม ให้มีความรู้ความสามารถแบบบูรณาการและมีทักษะในทางปฏิบัติให้มีประสิทธิผลด้วยคุณธรรม-จริยธรรม มีวิจารณญาณ และมีความรับผิดชอบต่อหน้าที่ในการพัฒนาบัณฑิตให้เป็นบุคลากรที่มีศักยภาพที่เหมาะสมกับรากฐานที่ดีของการพัฒนาประเทศ',
    CourseNameThai: 'วิทยาศาสตรบัณฑิต (ฟิสิกส์อุตสาหกรรม)',
    CourseNameEng: 'Bachelor of Science (Industrial Physics)',
    Job: [
      {name: 'นักวิทยาศาสตร์'},
      {name: 'นักวิชาการ'},
      {name: 'วิศวกรฝ่ายขาย'},
      {name: 'วิศวกรโรงงาน'},
      {name: 'นักวิจัยในภาครัฐและเอกชน'},
      {name: 'ผู้ประกอบการทางธุรกิจเทคโนโลยี'}
    ],
    Video: 'https://www.youtube.com/embed/nscnz7P8UUE',
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05016201',
              name: 'แคลคูลัส 1/CALCULUS 1',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05206500',
              name: 'ชีววิทยาทั่วไป/GENERAL BIOLOGY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05206501',
              name: 'ปฏิบัติการชีววิทยาทั่วไป/GENERAL BIOLOGY LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366001',
              name: 'ฟิสิกส์และการประยุกต์ 1/PHYSICS AND APPLICATIONS 1',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366002',
              name: 'ปฏิบัติการฟิสิกส์และการประยุกต์ 1/PHYSICS AND APPLICATIONS LABORATORY 1',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366022',
              name: 'การเขียนโปรแกรมคอมพิวเตอร์/COMPUTER PROGRAMMING',
              credit: 3,
              hours: '2-2-5'
            },
            {
              ID: '90644007',
              name: 'ภาษาอังกฤษพื้นฐาน 1/FOUNDATION ENGLISH 1',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90641002',
              name: 'ความฉลาดทางดิจิทัล/DIGITAL INTELLIGENCE QUOTIENT',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90641001',
              name: 'โรงเรียนสร้างเสน่ห์/CHARM SCHOOL',
              credit: 3,
              hours: '1-2-3'
            }
            
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05016202',
              name: 'แคลคูลัส 2/CALCULUS 2',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366003',
              name: 'ฟิสิกส์และการประยุกต์ 2/PHYSICS AND APPLICATIONS 2',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366004',
              name: 'ปฏิบัติการฟิสิกส์และการประยุกต์ 2/PHYSICS AND APPLICATIONS LABORATORY 2',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366021',
              name: 'ทฤษฎีวงจรไฟฟ้าและอิเล็กทรอนิกส์พื้นฐาน/ELECTRICAL CIRCUIT THEORY AND BASIC ELECTRONICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366025',
              name: 'อิเล็กทรอนิกส์ดิจิตอล/DIGITAL ELECTRONICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366043',
              name: 'การเขียนแบบและการฝึกงานวิศวกรรม/DRAWING AND ENGINEERING WORKSHOP',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90644008',
              name: 'ภาษาอังกฤษพื้นฐาน 2/FOUNDATION ENGLISH 2',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90641003',
              name: 'กีฬาและนันทนาการ/SPORTS AND RECREATIONAL ACTIVITIES',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกหมวดวิชาศึกษาทั่วไป/ELECTIVE TOPICS IN GENERAL EDUCATION',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05106030',
              name: 'เคมีทั่วไป/GENERAL CHEMISTRY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05106042',
              name: 'ปฏิบัติการเคมีทั่วไป/GENERAL CHEMISTRY LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366020',
              name: 'คณิตศาสตร์สําหรับนักฟิสิกส์/MATHEMATICS FOR PHYSICISTS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366023',
              name: 'อิเล็กทรอนิกส์/ELECTRONICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366032',
              name: 'สนามแม่เหล็กไฟฟ้า/ELECTROMAGNETICS FIELD',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366034',
              name: 'เซ็นเซอร์และทรานสดิวเซอร์/SENSORS AND TRANSDUCERS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366039',
              name: 'ปฏิบัติการฟิสิกส์ระดับกลาง 1/INTERMEDIATE PHYSICS LABORATORY 1',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางภาษา/ELECTIVE TOPICS IN LANGUAGE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05366024',
              name: 'ปฏิบัติการอิเล็กทรอนิกส์/ELECTRONICS LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366028',
              name: 'กลศาสตร์/MECHANICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366030',
              name: 'ฟิสิกส์ยุคใหม่/MODERN PHYSICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366033',
              name: 'คลื่นและทัศนศาสตร์/WAVES AND OPTICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366038',
              name: 'สถิติในงานอุตสาหกรรม/INDUSTRIAL STATISTICS	',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366040',
              name: 'ปฏิบัติการฟิสิกส์ระดับกลาง 2/INTERMEDIATE PHYSICS LABORATORY 2',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '0535xxxx',
              name: 'วิชาเลือก/ELECTIVE',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกตามเกณฑ์ของคณะวิทยาศาสตร์/ELECTIVE TOPICS FOR FACULTY COURSE REQUIREMENT',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05366027',
              name: 'ปฏิบัติการอิเล็กทรอนิกส์ดิจิตอล/DIGITAL ELECTRONICS LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05366031',
              name: 'ฟิสิกส์เชิงความร้อนและเชิงสถิติ/THERMAL AND STATISTICAL PHYSICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366035',
              name: 'ฟิสิกส์และเทคโนโลยีของสิ่งประดิษฐ์สารกึ่งตัวนำ/PHYSICS AND TECHNOLOGY OF SEMICONDUCTOR DEVICES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366036',
              name: 'ไมโครคอนโทรลเลอร์และการเชื่อมต่อ/MICROCONTROLLER AND INTERFACING',
              credit: 3,
              hours: '2-2-5'
            },
            {
              ID: '05366041',
              name: 'ปฏิบัติการฟิสิกส์อุตสาหกรรม 1/INDUSTRIAL PHYSICS LABORATORY 1',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '0535xxxx',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกตามเกณฑ์ของคณะวิทยาศาสตร์/ELECTIVE TOPICS FOR FACULTY COURSE REQUIREMENT',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: 'xxxxxxxx',
              name: 'วิชาเลือกเสรี/FREE ELECTIVE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05366029',
              name: 'กลศาสตร์ควอนตัมและเทคโนโลยีควอนตัม/QUANTUM MECHANICS AND QUANTUM TECHNOLOGY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366037',
              name: 'การวัดและเครื่องมือวัด/MEASUREMENT AND INSTRUMENTATION',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05366042',
              name: 'ปฏิบัติการฟิสิกส์อุตสาหกรรม 2/INDUSTRIAL PHYSICS LABORATORY 2',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '0535xxxx',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกตามเกณฑ์ของคณะวิทยาศาสตร์/ELECTIVE TOPICS FOR FACULTY COURSE REQUIREMENT	',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกหมวดวิชาศึกษาทั่วไป/ELECTIVE TOPICS IN GENERAL EDUCATION',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: 'xxxxxxxx',
              name: 'วิชาเลือกเสรี/FREE ELECTIVE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05366094',
              name: 'การฝึกงานต่างประเทศ/OVERSEAS TRAINING',
              credit: 6,
              hours: '0-45-0'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05366080',
              name: 'สัมมนา/SEMINAR',
              credit: 1,
              hours: '0-3-2'
            }
          ],
      }
    ],
    DownloadCourse: '-',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1.png',
  },{
    key:'appliedPhysics',
    name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'การศึกษาฟิสิกส์ประยุกต์และเทคโนโลยีแบบบูรณาการองค์ความรู้ และมีทักษะในทางปฏิบัติเพื่อเป็นรากฐานของการพัฒนาประเทศ',
    importance: 'การพัฒนาในประเทศไทยทางด้านนวิทยาศาสตร์ และเทคโนโลยียังขาดแคลนบุคลากรที่มีความรู้ มีความสามารถและทักษะในทางปฏิบัติเฉพาะทางด้านนฟิสิกส์และวสามารถนําความรู้มาประยุกต์เพื่อใช้ในการ วิเคราะห์และแก้ปัญหาในงานด้านนอุตสาหกรรม ด้านนพลังงาน ด้านนสิ่งแวดล้อม ด้านนสถาปัตยกรรม ด้านน การแพทย์ ด้านนเกษตรกรรม เป็นต้น สําหรับในงานแต่ละด้านนจะมีการซ่อมบํารุงและพัฒนาหรือประยุกต์ อุปกรณ์และเครื่องมือในการตรวจสอบและวิเคราะห์ทั้งในเชิงคุณภาพและเชิงปริมาณโดยจะอาศัยหลักการ พื้นฐานความรู้และความเชี่ยวชาญเฉพาะทางฟิสิกส์มาประยุกต์พร้อมกับสามารถบูรณาการความรู้และความ เข้าใจนําไปสู่งานวิจัย ผลงานประดิษฐ์นวัตกรรมอย่างสร้างสรรค์การตรวจสอบและวิเคราะห์เพื่อใช่้ แก้ปัญหาในงานด้านนต่างๆได้อย่างมีประสิทธิภาพด้วยคุณธรรมและจริยธรรม ดังนั้นหลักสูตรฟิสิกส์ประยุกต์จึงมีการวางแผนการศึกษาเพื่อพัฒนาหลักสูตรให้ทันสมัยผลิตบัณฑิต ให้ตรงกับความต้องการของตลาดแรงงาน และสอดคล้องตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาของ มาตรฐานการเรียนรู้ 5 ด้านน คือ คุณธรรม-จริยธรรม ความรู้ ทักษะทางปัญญา ทักษะความสัมพันธ์ ระหว่างบุคคลและความรับผิดชอบ ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยี สารสนเทศ ของหลักสูตรฟิสิกส์ประยุกต์วิชาเลือกทางฟิสิกส์ประยุกต์ ได้แก่ โซลิดสเตทอิเล็กทรอนิกส์ เครื่องมือวิทยาศาสตร์อุตสาหกรรม เทคโนโลยีทางแสงและการสื่อสาร และพลังงานทางเลือก โดยมุ่งเน้น ด้านนวิทยาศาสตร์และเทคโนโลยีเพื่อให้มีความสอดคล้องกับพันธกิจของสถาบันและกรอบทิศทางการศึกษา ตามแผนพัฒนาประเทศทั้งในด้านน เศรษฐกิจ สังคม และวัฒนธรรม ให้มีความรู้ความสามารถแบบบูรณาการ และมีทักษะในทางปฏิบัติให้มีประสิทธิผลด้วยคุณธรรม-จริยธรรม มีวิจารณญาณ และมีความรับผิดชอบ ต่อหน้าที่ในการพัฒนาบัณฑิตให้เป็นบุคลากรที่มีศักยภาพที่เหมาะสมกับรากฐานที่ดีของการพัฒนาประเทศ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์',
    CourseNameEng: 'Bachelor of Science Program in Applied Physics',
    Job: [
      {name: 'งานสอนเป็นอาจารย์ระดับสูงหลังศึกษาต่อ'},
      {name: 'การทดลองค้นคว้าวิจัย'},
      {name: 'งานตรวจสอบคุณภาพ'},
      {name: 'งานออกแบบวงจรอิเล็กทรอนิกส์'},
      {name: 'งานฮาร์ดแวร์การเชื่อมต่อคอมพิวเตอร์กับวงจรหรืออุปกรณ์อิเล็กทรอนิกส์'},
      {name: 'งานซ่อมบํารุงรักษา'},
      {name: 'รับราชการ'},
      {name: 'งานอื่น ๆ ที่ต้องการใช้ความรู้ทางฟิสิกส์'}
    ],
    Video: 'https://www.youtube.com/embed/V1S-WcZHWmc',
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05016201',
              name: 'แคลคูลัส 1/CALCULUS 1',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05206500',
              name: 'ชีววิทยาทั่วไป/GENERAL BIOLOGY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05206501',
              name: 'ปฏิบัติการชีววิทยาทั่วไป/GENERAL BIOLOGY LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05306011',
              name: '	ฟิสิกส์พื้นฐาน/FUNDAMENTAL PHYSICS 1',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306012',
              name: 'ปฏิบัติการฟิสิกส์พื้นฐาน/FUNDAMENTAL PHYSICS LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางภาษา/ELECTIVE TOPICS IN LANGUAGE',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: '	วิชาวิทยาศาสตร์และคณิตศาสตร์ หมวดศึกษาทั่วไป/ELECTIVE TOPICS IN SCIENCE & MATHEMATICS',
              credit: 3,
              hours: '3'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางสังคมศาสตร์/ELECTIVE TOPICS IN SOCIAL SCIENCE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05016202',
              name: 'แคลคูลัส 2/CALCULUS 2',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05106030',
              name: 'เคมีทั่วไป/GENERAL CHEMISTRY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05106042',
              name: 'ปฏิบัติการเคมีทั่วไป/GENERAL PHYSICS LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05306013',
              name: 'ฟิสิกส์พื้นฐาน 2/FUNDAMENTAL PHYSICS 2',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306014',
              name: 'ปฏิบัติการฟิสิกส์พื้นฐาน 2/FUNDAMENTAL PHYSICS LABORATORY 2',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางสังคมศาสตร์/ELECTIVE TOPICS IN SOCIAL SCIENCE',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางภาษา/ELECTIVE TOPICS IN LANGUAGE',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางมนุษยศาสตร์/ELECTIVE TOPICS IN HUMANITY',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05306221',
              name: 'คณิตศาสตร์สําหรับนักฟิสิกส์/MATHEMATICS FOR PHYSICISTS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306223',
              name: 'ทฤษฎีวงจรไฟฟ้าและการวิเคราะห์/ELECTRIC CIRCUIT THEORY AND ANALYSIS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306224',
              name: 'สนามแม่เหล็กไฟฟ้า/ELECTROMAGNETIC FIELD',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306225',
              name: 'กลศาสตร์/MECHANICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306226',
              name: 'ฟิสิกส์ยุคใหม่/MODERN PHYSICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306234',
              name: 'ปฏิบัติการฟิสิกส์ระดับกลาง 1/INTERMEDIATE PHYSICS LABORATORY 1',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางภาษา/ELECTIVE TOPICS IN LANGUAGE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05306222',
              name: 'การสั่นและคลื่น/VIBRATIONS AND WAVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306227',
              name: 'ฟิสิกส์เชิงความร้อนและเชิงสถิติ/THERMAL AND STATISTICAL PHYSICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306228',
              name: 'กลศาสตร์ควอนตัม/QUANTUM MECHANICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306229	',
              name: 'อิเล็กทรอนิกส์/ELECTRONICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306230',
              name: 'การเขียนโปรแกรมคอมพิวเตอร์และการวิเคราะห์ตัวเลข/COMPUTER PROGRAMMING AND NUMERICAL ANALYSIS',
              credit: 3,
              hours: '2-2-5'
            },
            {
              ID: '05306235',
              name: 'ปฏิบัติการฟิสิกส์ระดับกลาง 2/INTERMEDIATE PHYSICS LABORATORY 2',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05306221',
              name: 'การเขียนแบบและการฝึกงานทางวิศวกรรม/DRAWING AND ENGINEERING WORKSHOP',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx	',
              name: '	วิชาเลือกทางภาษา/ELECTIVE TOPICS IN LANGUAGE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05306233',
              name: 'ฟิสิกส์โซลิดสเตท/SOLID STATE PHYSICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306236',
              name: 'ปฏิบัติการอิเล็กทรอนิกส์/ELECTRONICS LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '05306238',
              name: 'อิเล็กทรอนิกส์ดิจิตอล/DIGITAL ELECTRONICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '05306239',
              name: 'ไมโครคอนโทรลเลอร์และการเชื่อมต่อ/MICROCONTROLLER AND INTERFACING',
              credit: 3,
              hours: '2-2-5'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือกทางปฏิบัติการ/ELECTIVES LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกเสรี/FREE ELECTIVE COURSES',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 3 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05306240',
              name: 'ปฏิบัติการอิเล็กทรอนิกส์ดิจิตอล/DIGITAL ELECTRONICS LABORATORY',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือกทางปฏิบัติการ/ELECTIVES LABORATORY',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกทางมนุษยศาสตร์/ELECTIVES TOPICS IN HUMANITY',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05306241',
              name: 'สัมมนา/SEMINAR',
              credit: 1,
              hours: '0-3-2'
            },
            {
              ID: '053XXXXX',
              name: 'วิชาเลือก/ELECTIVES',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาวิทยาศาสตร์และคณิตศาสตร์ หมวดศึกษาทั่วไป/ELECTIVE TOPICS IN SCIENCE & MATHEMATICS',
              credit: 3,
              hours: '3-0-6'
            },
            {
              ID: '90xxxxxx',
              name: 'วิชาเลือกเสรี/ELECTIVE',
              credit: 3,
              hours: '3-0-6'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 4 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05306315',
            name: 'โครงงานพิเศษ/SPECIAL PROJECT 2',
            credit: 6,
            hours: '0-450-225'
          },
          {
            ID: '05306316',
            name: 'สหกิจศึกษา/CO-OPERATIVE EDUCATION',
            credit: 6,
            hours: '0-450-225'
          },
          {
            ID: '05306317',
            name: 'การปฏิบัติการฝึกงานต่างประเทศ/OVERSEAS TRAINING',
            credit: 6,
            hours: '0-450-225'
          }
        ],
      }
    ],
    DownloadCourse: '-',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1.png',
  },{
    key:'biology',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาเทคโนโลยีชีวภาพ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'ผลิตบัณฑิตที่มีคุณธรรม มีความรู้ความสามารถในการคิด วิเคราะห์ด้วยกระบวนการทาง วิทยาศาสตร์และนํามาประยุกต์ใช้เพื่อแก้ปัญหา และพัฒนาศาสตร์ทางเทคโนโลยีชีวภาพให้สอดคล้องและ ตอบสนองต่อความต้องการของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและ เกษตรกรรมของประเทศ รวมทั้งการเพิ่มมลูค่าผลิตภัณฑ์ทั้งนี้ความก้าวหน้า ทางเทคโนโลยีชีวภาพได้ก่อให้เกิดความหวังใหม่ๆ โดยเนินงานวิจัยทางเทคนิคพันธุวิศวกรรมเพื่อปรับปรุงพันธุ์ สิ่งมีชีวิต และกระบวนการผลิตผลิตภัณฑ์ทางชีวภาพ จึงถือได้ว่ามีความสําคัญอย่างมากต่อการขับเคลื่อนการ พัฒนาในด้านต่างๆ ของประเทศ และสอดรับกับทิศทางของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวชาเทคโนโลยีชีวภาพ',
    CourseNameEng: 'Master of Science Program in Biotechnology',
    Job: [
      {name: 'อาจารย์ด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิจัยด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิชาการด้านเทคโนโลยชีีวภาพในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระที่ใช้ความรู้ทางด้านเทคโนโลยีชีวภาพ'},
      {name: 'ศึกษาต่อระดับปริญญาเอกในสาขาที่เกี่ยวข้อง'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05207307',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05207198',
            name: 'สัมมนา 1 (ไม่นับหน่วยกิต)/SEMINAR 1',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05207307',
              name: 'วิทยานิพนธ์/THESIS',
              credit: 9,
              hours: '0-405-0'
            },
            {
              ID: '05207199',
              name: 'สัมมนา 2 (ไม่นับหน่วยกิต)/SEMINAR 2',
              credit: 1,
              hours: '0-2-1'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
            {
              ID: '05207307',
              name: 'วิทยานิพนธ์/THESIS',
              credit: 9,
              hours: '0-405-0'
            }
          ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
            {
              ID: '05207307',
              name: 'วิทยานิพนธ์/THESIS',
              credit: 9,
              hours: '0-405-0'
            }
          ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/bio_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A0%E0%B8%B2%E0%B8%9E.png',
  },{
    key:'biologyEng',
    name: 'BACHELOR OF SCIENCE PROGRAM IN INDUSTRIAL MICROBIOLOGY (INTERNATIONAL PROGRAM) NEW PROGRAM 2016',
    philosophy: 'Collaboration with Other : Institutes The program is in collaboration with Faculty of Biotechnology, Assumption University, Thailand according to the memorandum of understanding (MOU)',
    importance: 'One degree 133 credits / Two degree 154 credits',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาจุลชีววิทยาอุตสาหกรรม (หลักสูตรนานาชาติ)',
    CourseNameEng: 'Bachelor of Science Program in Industrial Microbiology (International Program)',
    Job: [],
    Video: 'https://www.youtube.com/embed/-DPuYUSpNwA',
    Plan: [
      {
        type: 'kmitl_au',
        name: '1st YEAR 1st SEMESTER',
        Term: [
          {
            ID: '05656001',
            name: 'CALCULUS 1 FOR BIOSCIENCE/CALCULUS 1 FOR BIOSCIENCE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05656005',
            name: 'GENERAL CHEMISTRY/GENERAL CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05656006',
            name: 'GENERAL CHEMISTRY LABORATORY/GENERAL CHEMISTRY LABORATORY',
            credit: 1,
            hours: '0-3-2'
          },
          {
            ID: '05656054',
            name: 'PRINCIPLE OF BIOLOGY/PRINCIPLE OF BIOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05656055',
            name: 'BIOLOGY LABORATORY/BIOLOGY LABORATORY',
            credit: 1,
            hours: '0-3-2'
          },
          {
            ID: '05636001',
            name: 'GENERAL PSYCOLOGY/GENERAL PSYCOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05646001	',
            name: 'INTRODUCTION TO ECONOMICS/INTRODUCTION TO ECONOMICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05626001',
            name: 'ENGLISH 1/ENGLISH 1',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      // {
      //   key: 'kmitl_au',
      //   name: '1st YEAR 2nd SEMESTER',
      //   Term: [
      //     {
      //       ID: '',
      //       name: '',
      //       credit: ,
      //       hours: ''
      //     }
      //   ],
      // },
      
    ],
    DownloadCourse: '-',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%88%E0%B8%B8%E0%B8%A5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2.png',
  },{
    key:'statistic',
    name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์และการวิเคราะห์ข้อมูล หลักสูตรปี พ.ศ.2565',
    philosophy: 'เพื่อผลิตบุคลากรทางด้านสถิติที่มีความรู้ความสามารถทั้งในด้านทฤษฎีและการประยุกต์ในด้านสถิติการวิจัยดําเนินงาน และวิทยาการข้อมูล ตลอดจนสามารถนําเอาเทคโนโลยีที่ทันสมัย ไปประยุกต์ใช้งานหรือทําวิจัยในด้านต่างๆ เช่น สังคมศาสตร์ มนุษยศาสตร์ วิทยาศาสตร์กายภาพ วิทยาศาสตร์ชีวภาพอุตสาหกรรม ธุรกิจการขนส่ง เป็นต้น โดยคํานึงถึงคุณธรรม จริยธรรมทางวิชาชีพ',
    importance:'ในสังคมไทยปัจจุบันนี้จะเห็นว่าการใช้ข้อมูลข่าวสารเป็นสิ่งที่จําเป็นและมีอัตราการใช้เพิ่มขึ้นอย่างรวดเร็ว สถิติจะช่วยให้ข้อมูลข่าวสารที่นํามาใช้นั้นมีความถูกต้องและน่าเชื่อถือมากขึ้น เพื่อนําไปวางแผนและบริหารงานในภาครัฐและภาคเอกชนได้ดังนั้นวิธีการทางสถิติและเทคโนโลยีถือเป็นเครื่องมือที่มาช่วยในการคัดกรองข้อมูลข้าวสารให้มีประสิทธิภาพน่าเชื่อถือมากขึ้น อย่างไรก็ตามการนําวิธีการทางสถิติรวมทั้งเทคโนโลยีที่ทันสมัยมาประยุกต์ใช้ให้เกิดประโยชน์ในงานต่างๆ นั้น บุคลากรจําเป็นต้องมีความรู้ความเข้าใจที่ดีทั้งในเชิงสถิติและเทคโนโลยีที่ทันสมัย ทางภาควิชาสถิติจึงเล็งเห็นความสําคัญในหลักสูตรด้านสถิติประยุกต์ที่สามารถนําไปพัฒนาบุคลากรให้มีความเชี่ยวชาญในการนําเอาสถิติและเทคโนโลยีไปใช้ให้เกิดประโยชน์สูงสุด ถือเป็นการตอบสนองต่อการพัฒนาประเทศต่อไป',
    CourseNameThai: 'วิทยาศาสตรบัณฑิต สาขาสถิติประยุกต์และการวิเคราะห์ข้อมูล',
    CourseNameEng: 'Bachelor of Science in Applied Statistics and Data Analytics',
    Job: [
      {name: 'นักสถิติ'},
      {name: 'นักวิชาการทางสถิติ'},
      {name: 'นักวิเคราะห์ข้อมูลทางสถิติ'},
      {name: 'เจ้าหน้าที่ควบคุมคุณภาพ'},
      {name: 'เจ้าหน้าที่วางแผนการผลิต'},
      {name: 'เจ้าหน้าที่วิเคราะห์นโยบายและแผน'},
      {name: 'เจ้าหน้าที่บริหารงานทั่วไป'},
      {name: 'นักวิจัย'},
      {name: 'นักสถิติประกันภัย'},
      {name: 'เจ้าหน้าที่วิเคราะห์ระบบ'},
      {name: 'โปรแกรมเมอร์'},
      {name: 'ครูอาจารย์'},
      {name: 'เจ้าหน้าที่วิจัยตลาด'},
      {name: 'นักวิทยาการข้อมูล'},
    ],
    Video: 'https://www.youtube.com/embed/x2-If-10a8M',
    Plan: [],
    DownloadCourse: 'https://www.science.kmitl.ac.th/assets/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3%E0%B8%AA%E0%B8%96%E0%B8%B4%E0%B8%95%E0%B8%B4.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%AA%E0%B8%96%E0%B8%B4%E0%B8%95%E0%B8%B4.png',
  }
]


