import { Department } from '@/types/department'

export const detailDepartment: Department[] = [
  {
    key:'appliedChemist1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาเคมีประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'มุ้งเน้นในการสร้างองค์ความรู้ใหม่ทางวิทยาศาสตร์ สาขาเคมี และผลิตบุคลากรที่สามารถประยุกต์ใช้องค์ความรู้เพื่อการพัฒนาประเทศ มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ สามารถเรียนความรู้ใหม่ผสมผสานต่อยอดเทคโนโลยีด้านต่างๆ เพิ่มขีดความสามารถในการแข่งขันภายใต้การเปลี่ยนแปลง',
    importance: '',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมี',
    CourseNameEng: 'Master of Science Program in Chemistry',
    Job: [
      {name: ''}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [
      // {
      //   credit: 48,
      //   Category: [
      //     {
      //       name: 'หมวดวิชาศึกษาทั่วไป',
      //       credit: 48,
      //       subject: [
      //         {
      //           name: '1. หมวดวิชาวิทยานิพนธ์',
      //           credit: 6,
      //           sub: [
      //             {
      //               name: '1.41 กลุ่มทักษะที่จําเป็นในศตวรรษที่ 21 และส่งเสริมอัตลักษณ์สถาบันฯ',
      //               detail: [
      //                 {
      //                   ID: '90641001',
      //                   name: 'โรงเรียนสร้างเสน่ห์ CHARM SCHOOL',
      //                   compulsory: 'ไม่มี',
      //                   credit: 2,
      //                   hours: '1-2-3'
      //                 },
      //                 {
      //                   ID: '90641002',
      //                   name: 'ความฉลาดทางดิจิทัล DIGITAL INTELLIGENCE QUOTIENT',
      //                   compulsory: 'ไม่มี',
      //                   credit: 3,
      //                   hours: '3-0-6'
      //                 },
      //                 {
      //                   ID: '90641003',
      //                   name: 'กีฬาและนันทนาการ SPORTS AND RECREATIONAL ACTIVITIES',
      //                   compulsory: '90595002 ภาษาอังกฤษเพื่อการสื่อสาร',
      //                   credit: 1,
      //                   hours: '0-3-2'
      //                 }
      //               ]
      //             }
      //           ]
      //         }
      //       ]
      //     }
      //   ] 
      // }
    ],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05157003',
            name: 'สัมมนาทางเคมีประยุกต์ 1/SEMINAR IN APPLIED CHEMISTRY 1',
            credit: 1,
            hours: '0-2-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05157004',
            name: 'สัมมนาทางเคมีประยุกต์ 2/SEMINAR IN APPLIED CHEMISTRY 2',
            credit: 1,
            hours: '0-2-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: ''
  },
  {
    key:'appliedChemist2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาเคมีประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'มุ้งเน้นในการสร้างองค์ความรู้ใหม่ทางวิทยาศาสตร์ สาขาเคมี และผลิตบุคลากรที่สามารถประยุกต์ใช้องค์ความรู้เพื่อการพัฒนาประเทศ มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ สามารถเรียนความรู้ใหม่ผสมผสานต่อยอดเทคโนโลยีด้านต่างๆ เพิ่มขีดความสามารถในการแข่งขันภายใต้การเปลี่ยนแปลง',
    importance: '',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมี',
    CourseNameEng: 'Master of Science Program in Chemistry',
    Job: [
      {name: ''}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05157005',
            name: 'ระเบียบวิธีวิจัย/RESEARCH METHODOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157006	',
            name: 'นวัตกรรมเคมีประยุกต์/INNOVATIONS IN APPLIED CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157007',
            name: 'เทคนิคสําหรับการวิเคราะห์สารเชิงปริมาณและการตรวจพิสูจน์เอกลักษณ์ทางโครงสร้าง/TECHNIQUES FOR QUANTITATIVE ANALYSIS AND STRUCTURAL CHARACTERIZATION',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157008',
            name: 'สารมัธยันตร์ที่ว่องไวในเคม/REACTIVE INTERMEDIATES IN CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05157009',
            name: 'จลนพลศาสตร์และกลไกของปฏิกิริยาเคมี/KINETICS AND MECHANISM OF CHEMICAL REACTIONS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157xxx',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157xxx',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05157xxx',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          },
          {
            ID: '05157004',
            name: 'สัมมนาทางเคมีประยุกต์ 1/SEMINAR IN APPLIED CHEMISTRY 1',
            credit: 1,
            hours: '0-2-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05157001',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          },
          {
            ID: '05157004',
            name: 'สัมมนาทางเคมีประยุกต์ 1/SEMINAR IN APPLIED CHEMISTRY 1',
            credit: 1,
            hours: '0-2-0'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: ''
  },
  {
    key:'environmentalChemist1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาเคมีสิ่งแวดล้อม (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบัณฑิตที่มีความรอบรู้ในทางวิชาการ ทั้งด้านการจัดการสารเคมีและการป้องกันแก้ไขปัญหาทางสิ่งแวดล้อม มีทักษะกระบวนการวิเคราะห์วิจัย และสามารถบูรณาการความรู้ทางวิชาการและงานวิจัยมาใช้ในการป้องกัน แก้ไขและลดผลกระทบที่เกิดขึ้นจากปัญหาสารเคมีและสิ่งแวดล้อมได้อย่างมีประสิทธิภาพเพื่อส่งเสริมการบริหารจัดการด้านสารเคมีและสิ่งแวดล้อมของประเทศให้มีความยั่งยืน',
    importance: 'ปัญหาความเสื่อมโทรมและการลดลงของทรัพยากรธรรมชาติตลอดจนปัญหาทางสิ่งแวดล้อมที่เพิ่ม สูงขึ้นตามการขยายตัวของเศรษฐกิจและชุมชนเมือง ทำให้งานด้านสิ่งแวดล้อมเข้ามามีบทบาทสําคัญใน กิจกรรมด้านต่างๆ ไม่ว่าจะเป็นภาคอุตสาหกรรมที่นอกจากคํานึงถึงกระบวนการผลิตและการกำจัดของเสีย จากขั้นตอนการผลิตไม่ให้ส่งผลกระทบต่อสิ่งแวดล้อม ยังมีการนําเข้าสารเคมีโดยเฉพาะสารอันตรายในภาค การผลิตที่ต้องการการบริหารจัดการอย่างมีประสิทธิภาพ ภาคการเกษตรที่ต้องมีการบริหารจัดการดิน น้ำและ สารเคมีตลอดจนใช้เทคโนโลยีเพื่อให้ได้ผลผลิตที่ไม่ทำลายสภาพแวดล้อม และภาคชุมชนที่ต้องส่งเสริมให้เกิด การบริโภคที่เป็นมิตรต่อสิ่งแวดล้อม นอกจากกฎหมายและมาตรฐานในประเทศที่เป็นสิ่งสําคัญแล้ว ยังมี สนธิสัญญาและพันธกรณีระหว่างประเทศที่จะต้องให้ความสำคัญ ดังนั้นการพัฒนาบุคลากรที่มีความรอบรู้ ทั้งด้านเคมีและสิ่งแวดล้อมจึงถือได้ว่ามีความสําคัญอย่างมากต่อการขับเคลื่อนการพัฒนาในด้านต่างๆ ของ ประเทศ และสอดรับกับทิศทางของแผนยุทธศาสตร์การจัดการสารเคมีแห่งชาติฉบับที่ 4 (พ.ศ.2555-2564) และทิศทางของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมีสิ่งแวดล้อม',
    CourseNameEng: 'Master of Science Program in Environmental Chemistry',
    Job: [
      {name: ''}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117180',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05117302',
            name: 'ระเบียบวิธีวิจัยและการวิเคราะห์ทางสิ่งแวดล้อม/RESEARCH METHODOLOGY AND ENVIRONMENTAL ANALYSIS',
            credit: 3,
            hours: '2-3-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117180',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05117191',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 1/SEMINAR IN ENVIRONMENTAL CHEMISTRY 1',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117180',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05117192',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 2/SEMINAR IN ENVIRONMENTAL CHEMISTRY 2',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117180',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: '',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%84%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%B4%E0%B9%88%E0%B8%87%E0%B9%81%E0%B8%A7%E0%B8%94%E0%B8%A5%E0%B9%89%E0%B8%AD%E0%B8%A1.png'
  },
  {
    key:'environmentalChemist2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาเคมีสิ่งแวดล้อม (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบัณฑิตที่มีความรอบรู้ในทางวิชาการ ทั้งด้านการจัดการสารเคมีและการป้องกันแก้ไขปัญหาทางสิ่งแวดล้อม มีทักษะกระบวนการวิเคราะห์วิจัย และสามารถบูรณาการความรู้ทางวิชาการและงานวิจัยมาใช้ในการป้องกัน แก้ไขและลดผลกระทบที่เกิดขึ้นจากปัญหาสารเคมีและสิ่งแวดล้อมได้อย่างมีประสิทธิภาพเพื่อส่งเสริมการบริหารจัดการด้านสารเคมีและสิ่งแวดล้อมของประเทศให้มีความยั่งยืน',
    importance: 'ปัญหาความเสื่อมโทรมและการลดลงของทรัพยากรธรรมชาติตลอดจนปัญหาทางสิ่งแวดล้อมที่เพิ่ม สูงขึ้นตามการขยายตัวของเศรษฐกิจและชุมชนเมือง ทำให้งานด้านสิ่งแวดล้อมเข้ามามีบทบาทสําคัญใน กิจกรรมด้านต่างๆ ไม่ว่าจะเป็นภาคอุตสาหกรรมที่นอกจากคํานึงถึงกระบวนการผลิตและการกำจัดของเสีย จากขั้นตอนการผลิตไม่ให้ส่งผลกระทบต่อสิ่งแวดล้อม ยังมีการนําเข้าสารเคมีโดยเฉพาะสารอันตรายในภาค การผลิตที่ต้องการการบริหารจัดการอย่างมีประสิทธิภาพ ภาคการเกษตรที่ต้องมีการบริหารจัดการดิน น้ำและ สารเคมีตลอดจนใช้เทคโนโลยีเพื่อให้ได้ผลผลิตที่ไม่ทำลายสภาพแวดล้อม และภาคชุมชนที่ต้องส่งเสริมให้เกิด การบริโภคที่เป็นมิตรต่อสิ่งแวดล้อม นอกจากกฎหมายและมาตรฐานในประเทศที่เป็นสิ่งสําคัญแล้ว ยังมี สนธิสัญญาและพันธกรณีระหว่างประเทศที่จะต้องให้ความสำคัญ ดังนั้นการพัฒนาบุคลากรที่มีความรอบรู้ ทั้งด้านเคมีและสิ่งแวดล้อมจึงถือได้ว่ามีความสําคัญอย่างมากต่อการขับเคลื่อนการพัฒนาในด้านต่างๆ ของ ประเทศ และสอดรับกับทิศทางของแผนยุทธศาสตร์การจัดการสารเคมีแห่งชาติฉบับที่ 4 (พ.ศ.2555-2564) และทิศทางของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมีสิ่งแวดล้อม',
    CourseNameEng: 'Master of Science Program in Environmental Chemistry',
    Job: [
      {name: ''}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117301',
            name: 'เคมีสิ่งแวดล้อม/ENVIRONMENTAL CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117302',
            name: 'ระเบียบวิธีวิจัยและการวิเคราะห์ทางสิ่งแวดล้อม/RESEARCH METHODOLOGY AND ENVIRONMENTAL ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117303',
            name: 'การบริหารจัดการสารเคมีและวัตถุอันตราย/MANAGEMENT OF CHEMICAL AND HAZARDOUS MATERIALS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117305',
            name: 'มลพิษทางอากาศและการควบคุม/AIR POLLUTION AND CONTROL',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117304',
            name: 'เทคโนโลยีการบําบัดน้ำและน้ำเสีย/WATER AND WASTEWATER TREATMENT TECHNOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117306',
            name: 'เทคโนโลยีการจัดการขยะและของเสียอันตราย/SOLID AND HAZARDOUS WASTE MANAGEMENT TECHNOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117191',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 1/SEMINAR IN ENVIRONMENTAL CHEMISTRY 1',
            credit: 1,
            hours: '3-0-6'
          },
          {
            ID: '051174xx	',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: 'x-x-x'
          },
          {
            ID: '051174xx	',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: 'x-x-x'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117190',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          },
          {
            ID: '05117192',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 2/SEMINAR IN ENVIRONMENTAL CHEMISTRY 2',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117190',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/chemi_envi_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%84%E0%B8%A1%E0%B8%B5%E0%B8%AA%E0%B8%B4%E0%B9%88%E0%B8%87%E0%B9%81%E0%B8%A7%E0%B8%94%E0%B8%A5%E0%B9%89%E0%B8%AD%E0%B8%A1.png'
  },
  {
    key:'polymerChemist1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาเทคโนโลยีพอลิเมอร์ (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบุคลากรให้มีความรู้ความชํานาญด้านเทคโนโลยีพอลิเมอร์มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ สามารถนําความรู้ใหม่ผสมผสานต่อยอดเทคโนโลยีด้านต่าง ๆ เพิ่มขีดความสามารถในการแข่งขันภายใต้การเปลี่ยนแปลง และเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ไปสู่กระบวนการผลิตและแปรรูปผลิตภัณฑ์ในอุตสาหกรรม มีศักยภาพในการพึ่งพาตนเองมากขึ้นในอนาคต',
    importance: 'การพัฒนาทางอุตสาหกรรมเคมีจะนําไปสู่การพึ่งพาตนเองมากขึ้นในอนาคต งานอุตสาหกรรมเคมีที่เกี่ยวข้องกับพอลิเมอร์ถือเป็นส่วนหนึ่งที่มีความสําคัญ จึงจําเป็นต้องมีบุคลากรที่มีความรู้ความเข้าใจเกี่ยวกับเทคโนโลยีพอลิเมอร์อย่างดีด้วยเหตุนี้ภาควิชาเคมีจึงได้มุ่งผลตบิ ัณฑิตที่มีความรู้ ควบคู่กับการมีทักษะการวิจัยและพัฒนา สามารถนําหลักวิชาทางพอลิเมอร์ทั้งทางทฤษฎีและปฏิบัติไปประยุกต์ใช้ในทางอุตสาหกรรมพอลิเมอร์และเป็นส่วนหนึ่งเพื่อตอบสนองความต้องการของประเทศ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีพอลิเมอร์',
    CourseNameEng: 'Master of Science Program in Polymer Technology',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05147185',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05147185',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05147193',
            name: 'สัมมนาทางเทคโนโลยีพอลิเมอร์/SEMINAR IN POLYMER TECHNOLOGY',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05147185',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05147185',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/poli_mc2560.pdf',
    Infographic: ''
  },
  {
    key:'polymerChemist2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาเทคโนโลยีพอลิเมอร์ (หลักสูตรปรับปรุง พ.ศ. 2560)',
    philosophy: 'มุ่งผลิตบุคลากรให้มีความรู้ความชํานาญด้านเทคโนโลยีพอลิเมอร์มีคุณธรรมและจรรยาบรรณทางวิชาการและวิชาชีพ สามารถนําความรู้ใหม่ผสมผสานต่อยอดเทคโนโลยีด้านต่าง ๆ เพิ่มขีดความสามารถในการแข่งขันภายใต้การเปลี่ยนแปลง และเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ไปสู่กระบวนการผลิตและแปรรูปผลิตภัณฑ์ในอุตสาหกรรม มีศักยภาพในการพึ่งพาตนเองมากขึ้นในอนาคต',
    importance: 'การพัฒนาทางอุตสาหกรรมเคมีจะนําไปสู่การพึ่งพาตนเองมากขึ้นในอนาคต งานอุตสาหกรรมเคมีที่เกี่ยวข้องกับพอลิเมอร์ถือเป็นส่วนหนึ่งที่มีความสําคัญ จึงจําเป็นต้องมีบุคลากรที่มีความรู้ความเข้าใจเกี่ยวกับเทคโนโลยีพอลิเมอร์อย่างดีด้วยเหตุนี้ภาควิชาเคมีจึงได้มุ่งผลตบิ ัณฑิตที่มีความรู้ ควบคู่กับการมีทักษะการวิจัยและพัฒนา สามารถนําหลักวิชาทางพอลิเมอร์ทั้งทางทฤษฎีและปฏิบัติไปประยุกต์ใช้ในทางอุตสาหกรรมพอลิเมอร์และเป็นส่วนหนึ่งเพื่อตอบสนองความต้องการของประเทศ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีพอลิเมอร์',
    CourseNameEng: 'Master of Science Program in Polymer Technology',
    Job: [
      {name: 'อาจารย์ในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิจัยในสถาบันของรัฐและเอกชน'},
      {name: 'นักวิชาการในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117301',
            name: 'เคมีสิ่งแวดล้อม/ENVIRONMENTAL CHEMISTRY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117302',
            name: 'ระเบียบวิธีวิจัยและการวิเคราะห์ทางสิ่งแวดล้อม/RESEARCH METHODOLOGY AND ENVIRONMENTAL ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117303',
            name: 'การบริหารจัดการสารเคมีและวัตถุอันตราย/MANAGEMENT OF CHEMICAL AND HAZARDOUS MATERIALS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117305',
            name: 'มลพิษทางอากาศและการควบคุม/AIR POLLUTION AND CONTROL',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117304',
            name: 'เทคโนโลยีการบําบัดน้ำและน้ำเสีย/WATER AND WASTEWATER TREATMENT TECHNOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117306',
            name: 'เทคโนโลยีการจัดการขยะและของเสียอันตราย/SOLID AND HAZARDOUS WASTE MANAGEMENT TECHNOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05117191',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 1/SEMINAR IN ENVIRONMENTAL CHEMISTRY 1',
            credit: 1,
            hours: '3-0-6'
          },
          {
            ID: '051174xx	',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: 'x-x-x'
          },
          {
            ID: '051174xx	',
            name: 'วิชาเลือก/ELECTIVE COURSE',
            credit: 3,
            hours: 'x-x-x'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05117190',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          },
          {
            ID: '05117192',
            name: 'สัมมนาทางเคมีสิ่งแวดล้อม 2/SEMINAR IN ENVIRONMENTAL CHEMISTRY 2',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05117190',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/poli_mc2560.pdf',
    Infographic: ''
  },
  {
    key:'appliedMath1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'หลักสูตรพัฒนาบัณฑิตให้สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ในการแก้ปัญหาทาง วิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    importance: 'คณิตศาสตร์ประยุกต์สามารถแก้ปัญหา ลดต้นทุน ช่วยวางแผนงาน ทางวิทยาศาตร์อุตสาหกรรมและ ศาสตร์ต่างๆได้อย่างมีประสิทธิภาพ จึงมุ่งพัฒนาบัณฑิตที่มีความสามารถนําองค์ความรู้ไปประยุกต์ใช้เพื่อ พัฒนาบุคลากรให้มีความรู้ทางด้านคณิตศาสตร์ประยุกต์สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ ในการแก้ปัญหาทางวิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Mathematics',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'ครู อาจารย์ ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'},
      {name: 'นักวิเคราะห์/วางแผน กระบวนการทำงานในธุรกิจและอุตสาหกรรม'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017105',
            name: 'โปรแกรมคอมพิวเตอร์เพื่องานวิจัยทางคณิตศาสตร์ (*เรียนโดยไม่นับหน่วยกิต)/COMPUTER PROGRAMS FOR MATHEMATICAL RESEARCH',
            credit: 0,
            hours: '1-2-3'
          },
          {
            ID: '05017500',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 9,
            hours: '0-405-203'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017500',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 10,
            hours: '0-450-225'
          },
          {
            ID: '05017181',
            name: 'สัมมนา 1 (*เรียนโดยไม่นับหน่วยกิต)/SEMINAR 1',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017500',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 10,
            hours: '0-450-225'
          },
          {
            ID: '05017182',
            name: 'สัมมนา 2 (*เรียนโดยไม่นับหน่วยกิต)/SEMINAR 2',
            credit: 1,
            hours: '1-6-5'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017500',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 10,
            hours: '0-450-225'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/math_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedMath2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'หลักสูตรพัฒนาบัณฑิตให้สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ในการแก้ปัญหาทาง วิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    importance: 'คณิตศาสตร์ประยุกต์สามารถแก้ปัญหา ลดต้นทุน ช่วยวางแผนงาน ทางวิทยาศาตร์อุตสาหกรรมและ ศาสตร์ต่างๆได้อย่างมีประสิทธิภาพ จึงมุ่งพัฒนาบัณฑิตที่มีความสามารถนําองค์ความรู้ไปประยุกต์ใช้เพื่อ พัฒนาบุคลากรให้มีความรู้ทางด้านคณิตศาสตร์ประยุกต์สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ ในการแก้ปัญหาทางวิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Mathematics',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'ครู อาจารย์ ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'},
      {name: 'นักวิเคราะห์/วางแผน กระบวนการทำงานในธุรกิจและอุตสาหกรรม'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017105',
            name: 'โปรแกรมคอมพิวเตอร์เพื่องานวิจัยทางคณิตศาสตร์ (*เรียนโดยไม่นับหน่วยกิต)/COMPUTER PROGRAMS FOR MATHEMATICAL RESEARCH',
            credit: 0,
            hours: '1-2-3'
          },
          {
            ID: '05017101',
            name: 'คณิตวิเคราะห์ 1/MATHEMATICAL ANALYSIS 1',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017104',
            name: 'การวิเคราะห์เชิงตัวเลข/NUMERICAL ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017102',
            name: 'พีชคณิตเชิงเส้นขั้นสูง/ADVANCED LINEAR ALGEBRA',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017103',
            name: 'การหาค่าเหมาะสมที่สุดเชิงอุตสาหกรรม/INDUSTRIAL OPTIMIZATION',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017181',
            name: 'สัมมนา 1/SEMINAR 1',
            credit: 1,
            hours: '1-6-5'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017601',
            name: 'วิทยานิพนธ์ 1/THESIS 1',
            credit: 6,
            hours: '0-270-135'
          },
          {
            ID: '05017182',
            name: 'สัมมนา 2 /SEMINAR 2',
            credit: 1,
            hours: '1-6-5'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017602',
            name: 'วิทยานิพนธ์ 2/THESIS 2',
            credit: 6,
            hours: '0-270-135'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/math_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedMath3',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ข) สาขาวิชาคณิตศาสตร์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'หลักสูตรพัฒนาบัณฑิตให้สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ในการแก้ปัญหาทาง วิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    importance: 'คณิตศาสตร์ประยุกต์สามารถแก้ปัญหา ลดต้นทุน ช่วยวางแผนงาน ทางวิทยาศาตร์อุตสาหกรรมและ ศาสตร์ต่างๆได้อย่างมีประสิทธิภาพ จึงมุ่งพัฒนาบัณฑิตที่มีความสามารถนําองค์ความรู้ไปประยุกต์ใช้เพื่อ พัฒนาบุคลากรให้มีความรู้ทางด้านคณิตศาสตร์ประยุกต์สามารถนําองค์ความรู้ทางคณิตศาสตร์ไปประยุกต์ใช้ ในการแก้ปัญหาทางวิทยาศาสตร์อุตสาหกรรมหรือศาสตร์ที่เกี่ยวข้อง หรือพัฒนาองค์ความรู้ทางคณิตศาสตร์ได้',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Mathematics',
    Job: [
      {name: 'นักวิจัย'},
      {name: 'ครู อาจารย์ ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'},
      {name: 'นักวิเคราะห์/วางแผน กระบวนการทำงานในธุรกิจและอุตสาหกรรม'},
      {name: 'ประกอบอาชีพอิสระ'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017105',
            name: 'โปรแกรมคอมพิวเตอร์เพื่องานวิจัยทางคณิตศาสตร์ (*เรียนโดยไม่นับหน่วยกิต)/COMPUTER PROGRAMS FOR MATHEMATICAL RESEARCH',
            credit: 0,
            hours: '1-2-3'
          },
          {
            ID: '05017101',
            name: 'คณิตวิเคราะห์ 1/MATHEMATICAL ANALYSIS 1',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017104',
            name: 'การวิเคราะห์เชิงตัวเลข/NUMERICAL ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017102',
            name: 'พีชคณิตเชิงเส้นขั้นสูง/ADVANCED LINEAR ALGEBRA',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017103',
            name: 'การหาค่าเหมาะสมที่สุดเชิงอุตสาหกรรม/INDUSTRIAL OPTIMIZATION',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017181',
            name: 'สัมมนา 1/SEMINAR 1',
            credit: 1,
            hours: '1-6-5'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05017182',
            name: 'สัมมนา 2 /SEMINAR 2',
            credit: 1,
            hours: '1-6-5'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017701',
            name: 'การค้นคว้าอิสระ/INDEPENDENT STUDY',
            credit: 6,
            hours: '0-18-9'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '99050173',
            name: 'การสอบประมวลความรู้/COMPREHENSIVE EXAMINATION',
            credit: 0,
            hours: '0-0-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/math_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%84%E0%B8%93%E0%B8%B4%E0%B8%95%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'appliedPhysics1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาฟิสิกส์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'มุ่งผลิตบุคลากรที่มีความรู้ความชํานาญด้านฟิสิกส์ประยุกต์และมีจรรยาบรรณทางวิชาการและวิชาชีพ เพื่อส่งเสริมและเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ ซึ่งนําไปสู่กระบวนการผลิตและแปรรูปผลิตภัณฑ์ในอุตสาหกรรมที่มีประสิทธิภาพ มีศักยภาพในการพึ่งพาตนเองให้มากขึ้น โดยมุ่งเน้นการวิจัยและ การพัฒนาองค์ความรู้ใหม่ เชื่อมโยงกับศาสตร์ที่ตนเชี่ยวชาญและศาสตร์อื่นได้',
    importance: 'ในการพัฒนาเทคโนโลยีของตนเองเพื่อลดการพึ่งพาเทคโนโลยีจากต่างประเทศนั้นต้องอาศัยทรัพยากรบุคคลที่มีความรู้ความสามารถในด้านวิทยาศาสตร์เป็นอย่างมาก ด้วยเหตุนี้สาขาวิชาฟิสิกส์จึงได้มุ่งผลิตบัณฑิตที่มีความเชี่ยวชาญทางด้านฟิสิกส์พื้นฐานและฟิสิกส์ประยุกต์ทั้งทางทฤษฎีและปฏิบัติเพื่อ ตอบสนองความต้องการของประเทศและแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564) ที่เน้นการส่งเสริมและเร่งรัดการพัฒนากําลังคนด้านวิทยาศาสตร์เทคโนโลยีและนวัตกรรมให้เป็นพลังของประเทศ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Physics',
    Job: [
      {name: 'นักวิจัยและพัฒนาผลิตภัณฑ์ในหน่วยงานภาคอุตสาหกรรม เช่น อุตสาหกรรมผลิตชิ้นส่วน อิเล็กทรอนิกส์คอมพิวเตอร์ยานยนต์เครื่องมือทางการแพทย์และสิ่งแวดล้อม รวมทั้งอุตสาหกรรมเกษตร เป็นต้น'},
      {name: 'พนักงานควบคุมคุณภาพการผลิตและกระบวนการผลิตในภาคอุตสาหกรรม'},
      {name: 'ผู้ประกอบกิจการและตัวแทนจําหน่าย เครื่องมือวิทยาศาสตร์และเครื่องมือในงานวิศวกรรม'},
      {name: 'นักวิทยาศาสตร์และนักวิจัย ในหน่วยงานภาครัฐและในสถานศึกษาต่างๆ'},
      {name: 'ครู อาจารย์ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05308060',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0–360–180'
          },
          {
            ID: '05308001',
            name: 'สัมมนาปริญญาเอก 1/DOCTORAL SEMINAR 1',
            credit: 1,
            hours: '0-3-2'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05308060',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0–360–180'
          },
          {
            ID: '05308002',
            name: 'สัมมนาปริญญาเอก 2/DOCTORAL SEMINAR 2',
            credit: 1,
            hours: '0-3-2'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05308060',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0–360–180'
          },
          {
            ID: '05308003',
            name: 'สัมมนาปริญญาเอก 3/DOCTORAL SEMINAR 3',
            credit: 1,
            hours: '0-3-2'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05308060',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 8,
            hours: '0–360–180'
          },
          {
            ID: '05308004',
            name: 'สัมมนาปริญญาเอก 4/DOCTORAL SEMINAR 4',
            credit: 1,
            hours: '0-3-2'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/bio_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1.png'
  },
  {
    key:'appliedPhysics2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาฟิสิกส์ประยุกต์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'มุ่งผลิตบุคลากรที่มีความรู้ความชํานาญด้านฟิสิกส์ประยุกต์และมีจรรยาบรรณทางวิชาการและวิชาชีพ เพื่อส่งเสริมและเผยแพร่การประยุกต์ใช้เทคโนโลยีใหม่ ซึ่งนําไปสู่กระบวนการผลิตและแปรรูปผลิตภัณฑ์ในอุตสาหกรรมที่มีประสิทธิภาพ มีศักยภาพในการพึ่งพาตนเองให้มากขึ้น โดยมุ่งเน้นการวิจัยและ การพัฒนาองค์ความรู้ใหม่ เชื่อมโยงกับศาสตร์ที่ตนเชี่ยวชาญและศาสตร์อื่นได้',
    importance: 'ในการพัฒนาเทคโนโลยีของตนเองเพื่อลดการพึ่งพาเทคโนโลยีจากต่างประเทศนั้นต้องอาศัยทรัพยากรบุคคลที่มีความรู้ความสามารถในด้านวิทยาศาสตร์เป็นอย่างมาก ด้วยเหตุนี้สาขาวิชาฟิสิกส์จึงได้มุ่งผลิตบัณฑิตที่มีความเชี่ยวชาญทางด้านฟิสิกส์พื้นฐานและฟิสิกส์ประยุกต์ทั้งทางทฤษฎีและปฏิบัติเพื่อ ตอบสนองความต้องการของประเทศและแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564) ที่เน้นการส่งเสริมและเร่งรัดการพัฒนากําลังคนด้านวิทยาศาสตร์เทคโนโลยีและนวัตกรรมให้เป็นพลังของประเทศ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Physics',
    Job: [
      {name: 'นักวิจัยและพัฒนาผลิตภัณฑ์ในหน่วยงานภาคอุตสาหกรรม เช่น อุตสาหกรรมผลิตชิ้นส่วน อิเล็กทรอนิกส์คอมพิวเตอร์ยานยนต์เครื่องมือทางการแพทย์และสิ่งแวดล้อม รวมทั้งอุตสาหกรรมเกษตร เป็นต้น'},
      {name: 'พนักงานควบคุมคุณภาพการผลิตและกระบวนการผลิตในภาคอุตสาหกรรม'},
      {name: 'ผู้ประกอบกิจการและตัวแทนจําหน่าย เครื่องมือวิทยาศาสตร์และเครื่องมือในงานวิศวกรรม'},
      {name: 'นักวิทยาศาสตร์และนักวิจัย ในหน่วยงานภาครัฐและในสถานศึกษาต่างๆ'},
      {name: 'ครู อาจารย์ในสถาบันการศึกษา ทั้งของภาครัฐและเอกชน'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05307102',
            name: 'ทฤษฎีแม่เหล็กไฟฟ้า/ELECTROMAGNETIC THEORY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05307103',
            name: 'กลศาสตร์ควอนตัม/QUANTUM MECHANICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05307115',
            name: 'ฟิสิกส์สถานะของแข็งประยุกต์/APPLIED SOLID STATE PHYSICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05307189',
            name: 'ระเบียบวิธีวิจัย/RESEARCH METHODOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05017xxx',
            name: 'วิชาเลือก/ELECTIVE COURSES',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05307181',
            name: 'สัมมนา/SEMINAR',
            credit: 1,
            hours: '0-2-1'
          },
          {
            ID: '05307199',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05307199',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: '-',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%AA%E0%B8%B2%E0%B8%AB%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1.png'
  },
  {
    key:'biology1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาเทคโนโลยีชีวภาพ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'ผลิตบัณฑิตที่มีคุณธรรม มีความรู้ความสามารถในการคิด วิเคราะห์ด้วยกระบวนการทาง วิทยาศาสตร์และนํามาประยุกต์ใช้เพื่อแก้ปัญหา และพัฒนาศาสตร์ทางเทคโนโลยีชีวภาพให้สอดคล้องและ ตอบสนองต่อความต้องการของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและ เกษตรกรรมของประเทศ รวมทั้งการเพิ่มมลูค่าผลิตภัณฑ์ทั้งนี้ความก้าวหน้า ทางเทคโนโลยีชีวภาพได้ก่อให้เกิดความหวังใหม่ๆ โดยเนินงานวิจัยทางเทคนิคพันธุวิศวกรรมเพื่อปรับปรุงพันธุ์ สิ่งมีชีวิต และกระบวนการผลิตผลิตภัณฑ์ทางชีวภาพ จึงถือได้ว่ามีความสําคัญอย่างมากต่อการขับเคลื่อนการ พัฒนาในด้านต่างๆ ของประเทศ และสอดรับกับทิศทางของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวชาเทคโนโลยีชีวภาพ',
    CourseNameEng: 'Master of Science Program in Biotechnology',
    Job: [
      {name: 'อาจารย์ด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิจัยด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิชาการด้านเทคโนโลยชีวภาพในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระที่ใช้ความรู้ทางด้านเทคโนโลยีชีวภาพ'},
      {name: 'ศึกษาต่อระดับปริญญาเอกในสาขาที่เกี่ยวข้อง'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05207307',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05207198',
            name: 'สัมมนา 1 (ไม่นับหน่วยกิต)/SEMINAR 1',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05207307',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05207199',
            name: 'สัมมนา 2 (ไม่นับหน่วยกิต)/SEMINAR 2',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05207307',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05207307',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/bio_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A0%E0%B8%B2%E0%B8%9E.png'
  },
  {
    key:'biology2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาเทคโนโลยีชีวภาพ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'ผลิตบัณฑิตที่มีคุณธรรม มีความรู้ความสามารถในการคิด วิเคราะห์ด้วยกระบวนการทาง วิทยาศาสตร์และนํามาประยุกต์ใช้เพื่อแก้ปัญหา และพัฒนาศาสตร์ทางเทคโนโลยีชีวภาพให้สอดคล้องและ ตอบสนองต่อความต้องการของประเทศ',
    importance: 'เป็นหลักสูตรที่ผลิตบัณฑิตที่มีความรู้ ความเชี่ยวชาญในสาขาเทคโนโลยีชีวภาพ และส่งเสริมการ พัฒนาทางด้านอุตสาหกรรมและ เกษตรกรรมของประเทศ รวมทั้งการเพิ่มมลูค่าผลิตภัณฑ์ทั้งนี้ความก้าวหน้า ทางเทคโนโลยีชีวภาพได้ก่อให้เกิดความหวังใหม่ๆ โดยเนินงานวิจัยทางเทคนิคพันธุวิศวกรรมเพื่อปรับปรุงพันธุ์ สิ่งมีชีวิต และกระบวนการผลิตผลิตภัณฑ์ทางชีวภาพ จึงถือได้ว่ามีความสําคัญอย่างมากต่อการขับเคลื่อนการ พัฒนาในด้านต่างๆ ของประเทศ และสอดรับกับทิศทางของแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวชาเทคโนโลยีชีวภาพ',
    CourseNameEng: 'Master of Science Program in Biotechnology',
    Job: [
      {name: 'อาจารย์ด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิจัยด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิชาการด้านเทคโนโลยชีวภาพในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระที่ใช้ความรู้ทางด้านเทคโนโลยีชีวภาพ'},
      {name: 'ศึกษาต่อระดับปริญญาเอกในสาขาที่เกี่ยวข้อง'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05207309',
            name: 'ระเบียบวิธีวิจัยและการใช้เครื่องมือทางเทคโนโลยีชีวภาพ/RESEARCH METHODOLOGY AND INSTRUMENTATION IN BIOTECHNOLOGY',
            credit: 3,
            hours: '2-3-6'
          },
          {
            ID: '05207106',
            name: 'พันธุศาสตร์ระดับโมเลกุล/MOLECULAR GENETICS',
            credit: 4,
            hours: '3-3-8'
          },
          {
            ID: '05207191',
            name: 'สัมมนา 1 (ไม่นับหน่วยกิต)/SEMINAR 1',
            credit: 1,
            hours: '0-2-1'
          },
          {
            ID: '052072XX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: 'x-x-x'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05207104',
            name: 'กระบวนการชีวภาพในอุตสาหกรรมการหมัก/BIOPROCESS IN INDUSTRIAL FERMENTATION',
            credit: 3,
            hours: '2-3-6'
          },
          {
            ID: '05207192',
            name: 'สัมมนา 2 (ไม่นับหน่วยกิต)/SEMINAR 2',
            credit: 1,
            hours: '0-2-1'
          },
          {
            ID: '052072XX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: 'x-x-x'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05207308',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 10,
            hours: '0-405-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05207308',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 10,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/bio_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%A0%E0%B8%B2%E0%B8%9E.png'
  },
  {
    key:'com1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก1) สาขาวิชาวิทยาการคอมพิวเตอร์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'เพื่อผลิตมหาบัณฑิต ให้มีความรู้ความสามารถทางวิทยาการคอมพิวเตอร์ มีทักษะในการวิจัยและ พัฒนา พร้อมเรียนรู้เทคโนโลยีใหม่ๆ สามารถบูรณาการศาสตร์ทางด้านวิทยาการคอมพิวเตอร์เพื่อพัฒนา หรือแก้ปัญหาของประเทศได้ มีคุณธรรม จริยธรรม รักษาจรรยาบรรณในวิชาชีพ สามารถทำงานร่วมกับ ผู้อื่นได้ดีทั้งในระดับผู้นำและผู้ตาม',
    importance: 'เนื่องด้วย วิทยาศาสตร์และเทคโนโลยีเป็นกลไกสำคัญในการพัฒนาประเทศให้ก้าวหน้า พร้อม แข่งขัน และรองรับการเปลี่ยนแปลงเศรษฐกิจโลก วิทยาการคอมพิวเตอร์เป็นสาขาวิชาหนึ่งที่มี ความสำคัญและจำเป็นต่อการพัฒนาทางด้านวิทยาศาสตร์และเทคโนโลยี จึงจำเป็นต้องมีบุคลากร ทางด้านวิทยาการคอมพิวเตอร์ รวมถึงบุคลากรที่มีความรู้ความชำนาญด้านการวิจัยทางวิทยาการ คอมพิวเตอร์อย่างเพียงพอ เพื่อเป็นองค์ประกอบที่เข้มแข็งในการพัฒนาประเทศต่อไป',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์',
    CourseNameEng: 'Master of Science Program in Computer Science',
    Job: [
      {name: 'อาจารย์ด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิจัยด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิชาการด้านเทคโนโลยชีวภาพในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระที่ใช้ความรู้ทางด้านเทคโนโลยีชีวภาพ'},
      {name: 'ศึกษาต่อระดับปริญญาเอกในสาขาที่เกี่ยวข้อง'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05507141',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05507189',
            name: 'ระเบียบวิธีวิจัยสําหรับวิทยาการคอมพิวเตอร์/RESEARCH METHODOLOGY IN COMPUTERSCIENCE',
            credit: 3,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05507141',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05207199',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 1 (ไม่นับหน่วยกิต)/SEMINAR IN COMPUTER SCIENCE 1',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05507141',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          },
          {
            ID: '05507188',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 2 (ไม่นับหน่วยกิต)/SEMINAR IN COMPUTER SCIENCE 2',
            credit: 1,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05507141',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 9,
            hours: '0-405-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/com_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'com2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาวิทยาการคอมพิวเตอร์ หลักสูตรปี พ.ศ. 2560',
    philosophy: 'เพื่อผลิตมหาบัณฑิต ให้มีความรู้ความสามารถทางวิทยาการคอมพิวเตอร์ มีทักษะในการวิจัยและ พัฒนา พร้อมเรียนรู้เทคโนโลยีใหม่ๆ สามารถบูรณาการศาสตร์ทางด้านวิทยาการคอมพิวเตอร์เพื่อพัฒนา หรือแก้ปัญหาของประเทศได้ มีคุณธรรม จริยธรรม รักษาจรรยาบรรณในวิชาชีพ สามารถทำงานร่วมกับ ผู้อื่นได้ดีทั้งในระดับผู้นำและผู้ตาม',
    importance: 'เนื่องด้วย วิทยาศาสตร์และเทคโนโลยีเป็นกลไกสำคัญในการพัฒนาประเทศให้ก้าวหน้า พร้อม แข่งขัน และรองรับการเปลี่ยนแปลงเศรษฐกิจโลก วิทยาการคอมพิวเตอร์เป็นสาขาวิชาหนึ่งที่มี ความสำคัญและจำเป็นต่อการพัฒนาทางด้านวิทยาศาสตร์และเทคโนโลยี จึงจำเป็นต้องมีบุคลากร ทางด้านวิทยาการคอมพิวเตอร์ รวมถึงบุคลากรที่มีความรู้ความชำนาญด้านการวิจัยทางวิทยาการ คอมพิวเตอร์อย่างเพียงพอ เพื่อเป็นองค์ประกอบที่เข้มแข็งในการพัฒนาประเทศต่อไป',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์',
    CourseNameEng: 'Master of Science Program in Computer Science',
    Job: [
      {name: 'อาจารย์ด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิจัยด้านเทคโนโลยีชีวภาพในสถาบัน/มหาวิทยาลัยของรัฐ และเอกชน'},
      {name: 'นักวิชาการด้านเทคโนโลยชีวภาพในสถาบันของรัฐและเอกชน'},
      {name: 'ประกอบอาชีพอิสระที่ใช้ความรู้ทางด้านเทคโนโลยีชีวภาพ'},
      {name: 'ศึกษาต่อระดับปริญญาเอกในสาขาที่เกี่ยวข้อง'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05507003',
            name: 'ขั้นตอนวิธีคอมพิวเตอร์/COMPUTER ALGORITHMS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507030',
            name: 'ระเบียบวิธีการพัฒนาซอฟต์แวร์/SOFTWARE DEVELOPMENT METHODOLOGY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507060',
            name: 'ตัวแบบการคํานวณ/MODELS OF COMPUTATION',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507189',
            name: 'ระเบียบวิธีวิจัยสําหรับวิทยาการคอมพิวเตอร์/RESEARCH METHODOLOGY IN COMPUTER SCIENCE',
            credit: 3,
            hours: '0-2-1'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05507031',
            name: 'วิทยาศาสตร์ข้อมูล/DATA SCIENCE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507187',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 1/SEMINAR IN COMPUTER SCIENCE 1',
            credit: 1,
            hours: '0-2-1'
          },
          {
            ID: '05507XXX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507XXX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05507188',
            name: 'สัมมนาทางวิทยาการคอมพิวเตอร์ 2/SEMINAR IN COMPUTER SCIENCE 2',
            credit: 1,
            hours: '0-2-1'
          },
          {
            ID: '05507142',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          },
          {
            ID: '05507XXX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05507XXX',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05507142',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: 'http://www.reg.kmitl.ac.th/curriculum/file/graduate/05/com_mc2560.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C.png'
  },
  {
    key:'statistic1',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) สาขาวิชาสถิติและการวิเคราะห์ธุรกิจ (หลักสูตรปรับปรุง พ.ศ. 2563)',
    philosophy: 'ผลิตบัณฑิตที่มีความรู้ความสามารถและทักษะทางสถิติและการวิเคราะห์ธุรกิจ เพื่อนําไป ประยุกต์ใช้กับศาสตร์ด้านต่าง ๆ เช่น สังคมศาสตร์ เศรษฐศาสตร์มนุษยศาสตร์ วิทยาศาสตร์กายภาพ และวิทยาศาสตร์ชีวภาพ ภายใต้พื้นฐานจริยธรรมและคุณธรรม',
    importance: 'การพัฒนาด้านวิทยาศาสตร์ดิจิทัล และเทคโนโลยีเป็นเรื่องสําคัญสําหรับการพัฒนาประเทศ ให้มีความก้าวหน้าทางสถิติในระดับสูงและเป็นเครื่องมือที่ช่วยในการวางแผน การควบคุมทางด้านนโยบาย และการจัดการของหน่วยงานของรัฐ องค์กรธุรกิจ อุตสาหกรรม ทั้งด้านการศึกษา ด้านอุตสาหกรรม ด้าน สาธารณสุข การแพทย์และอื่นๆ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติและการวิเคราะห์ธุรกิจ',
    CourseNameEng: 'Master of Science Program in Statistics and Business Analytics',
    Job: [],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407241',
            name: 'การประยุกต์ใช้สถิติเพื่อการวิเคราะห์ข้อมูล/APPLIED STATISTICS FOR DATA ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407242',
            name: 'สถิติวิเคราะห์เชิงพยากรณ์/STATISTICAL PREDICTIVE ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407243',
            name: 'การวิเคราะห์เชิงตัวเลข/PRESCRIPTIVE ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407244',
            name: 'วิธีการวิจัย/RESEARCH METHODS',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407300',
            name: 'สัมมนา/SEMINAR',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05407305',
            name: 'การศึกษาดูงานด้านสถิติและการวิเคราะห์ธุรกิจในต่างประเทศ/STUDY ON STATISTICS AND BUSINESS ANALYSIS IN OVERSEA',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '05407404',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05407404',
            name: 'วิทยานิพนธ์ /THESIS',
            credit: 6,
            hours: '0-270-0'
          }
        ],
      }
    ],
    DownloadCourse: 'https://www.reg.kmitl.ac.th/curriculum/file/graduate/05/StatAndBusi2563.pdf',
    Infographic: ''
  },
  {
    key:'statistic2',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ข) สาขาวิชาสถิติและการวิเคราะห์ธุรกิจ (หลักสูตรปรับปรุง พ.ศ. 2563)',
    philosophy: 'ผลิตบัณฑิตที่มีความรู้ความสามารถและทักษะทางสถิติและการวิเคราะห์ธุรกิจ เพื่อนําไป ประยุกต์ใช้กับศาสตร์ด้านต่าง ๆ เช่น สังคมศาสตร์ เศรษฐศาสตร์มนุษยศาสตร์ วิทยาศาสตร์กายภาพ และวิทยาศาสตร์ชีวภาพ ภายใต้พื้นฐานจริยธรรมและคุณธรรม',
    importance: 'การพัฒนาด้านวิทยาศาสตร์ดิจิทัล และเทคโนโลยีเป็นเรื่องสําคัญสําหรับการพัฒนาประเทศ ให้มีความก้าวหน้าทางสถิติในระดับสูงและเป็นเครื่องมือที่ช่วยในการวางแผน การควบคุมทางด้านนโยบาย และการจัดการของหน่วยงานของรัฐ องค์กรธุรกิจ อุตสาหกรรม ทั้งด้านการศึกษา ด้านอุตสาหกรรม ด้าน สาธารณสุข การแพทย์และอื่นๆ',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติและการวิเคราะห์ธุรกิจ',
    CourseNameEng: 'Master of Science Program in Statistics and Business Analytics',
    Job: [],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [], 
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407241',
            name: 'การประยุกต์ใช้สถิติเพื่อการวิเคราะห์ข้อมูล/APPLIED STATISTICS FOR DATA ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407242',
            name: 'สถิติวิเคราะห์เชิงพยากรณ์/STATISTICAL PREDICTIVE ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407243',
            name: 'การวิเคราะห์ข้อมูลเชิงกำหนด/PRESCRIPTIVE ANALYTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407244',
            name: 'วิธีการวิจัย/RESEARCH METHODS',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05407250',
            name: 'การเขียนโปรแกรมและการจัดการข้อมูล/PROGRAMMING AND DATA MANAGEMENT',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '0507xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '0507xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407305',
            name: 'การศึกษาดูงานด้านสถิติและการวิเคราะห์ธุรกิจในต่างประเทศ/STUDY ON STATISTICS AND BUSINESS ANALYSIS IN OVERSEA',
            credit: 1,
            hours: '0-2-0'
          },
          {
            ID: '0507xxx',
            name: 'วิชาเลือก/ELECTIVES COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '0507xxx',
            name: 'วิชาเลือก/ELECTIVES COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407405',
            name: 'การค้นคว้าอิสระ/INDEPENDENT STUDY',
            credit: 3,
            hours: '0-135-0'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVES COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407405',
            name: 'การค้นคว้าอิสระ/INDEPENDENT STUDY',
            credit: 3,
            hours: '0-135-0'
          }
        ],
      }
    ],
    DownloadCourse: 'https://www.reg.kmitl.ac.th/curriculum/file/graduate/05/StatAndBusi2563.pdf',
    Infographic: ''
  },
  {
    key:'appliedstatistic',
    name: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต (แผนการเรียน ก2) วิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติประยุกต์ พ.ศ. 2564',
    philosophy: 'ผลิตมหาบัณฑิตที่มีความรู้ความสามารถและทักษะทางสถิติ และสามารถนำความรู้ทางสถิติไป ประยุกต์ใช้ในการทำวิจัยได้ถูกต้องตามศาสตร์และทฤษฎีทางสถิติเพียบพร้อมด้วยคุณธรรมและ จริยธรรม',
    importance: 'เป็นหลักสูตรที่มีเนื้อหาครอบคลุมทุกกระบวนการทางสถิติ ตั้งแต่ การเก็บรวบรวมข้อมูล การ เตรียมข้อมูล การวิเคราะห์ข้อมูล การนำเสนอข้อมูล และการแปลผล โดยหลักสูตรนี้เน้นทั้งด้านทฤษฎี ทางสถิติและการนำไปประยุกต์ใช้ได้อย่างถูกต้อง',
    CourseNameThai: 'หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติประยุกต์',
    CourseNameEng: 'Master of Science Program in Applied Statistics',
    Job: [
      {name: 'นักสถิติ นักวิชาการด้านสถิติ'},
      {name: 'ครู อาจารย์'},
      {name: 'นักวิจัย'},
      {name: 'บัณฑิตที่ต้องการศึกษาต่อในระดับปริญญาเอก'},
      {name: 'นักวิเคราะห์นโยบายและแผน'},
      {name: 'ผู้เชี่ยวชาญด้านวิเคราะห์ข้อมูล'},
      {name: 'เป็นที่ปรึกษาให้กับภาคธุรกิจ'},
      {name: 'นักวิทยาการข้อมูล'}
    ],
    Video: 'https://www.youtube.com/embed/P3afSO8cgxM',
    Structure: [],
    Plan: [
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407500',
            name: 'ทฤษฎีความน่าจะเป็นและการแจกแจง/PROBABILITY AND DISTRIBUTION THEORY',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407501',
            name: 'การถดถอยและการวิเคราะห์ข้อมูล/REGRESSION AND DATA ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVES COURSE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVES COURSE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 1 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05407502',
            name: 'สถิติเชิงอนุมาน/INFERENTIAL STATISTICS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407503',
            name: 'การวิเคราะห์สถิติหลายตัวแปร/MULTIVARIATE STATISTICAL ANALYSIS',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          },
          {
            ID: '05407xxx',
            name: 'วิชาเลือก/ELECTIVE',
            credit: 3,
            hours: '3-0-6'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 1',
        Term: [
          {
            ID: '05407600',
            name: 'สัมมนา/SEMINAR',
            credit: 0,
            hours: '0-2-2'
          },
          {
            ID: '05407603',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-135'
          }
        ],
      },
      {
        type: 'kmitl',
        name: 'ปีที่ 2 ภาคการศึกษาที่ 2',
        Term: [
          {
            ID: '05017602',
            name: 'วิทยานิพนธ์/THESIS',
            credit: 6,
            hours: '0-270-135'
          }
        ],
      }
    ],
    DownloadCourse: 'https://www.reg.kmitl.ac.th/curriculum/file/graduate/05/stat_mc2564.pdf',
    Infographic: 'https://www.science.kmitl.ac.th/assets/%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%81%E0%B8%AA%E0%B8%B9%E0%B8%95%E0%B8%A3%E0%B8%9B%E0%B9%82%E0%B8%97%E0%B8%AA%E0%B8%96%E0%B8%B4%E0%B8%95%E0%B8%B4.jpg'
  }
]